/*********************************************************************************************
脚本说明：以下脚本用于输出参保个体线索，运行时请替换实际的机构编码、机构名称
机构编码：H00000000000
机构名称：测试医院
**********************************************************************************************/

select * from(
select 
    机构名称,
    姓名,
    身份证号,
    持证类别,
    count(distinct 身份证号 || to_char(门诊日期,'YYYYMMDD')) 就医人次,
    count(distinct to_char(门诊日期,'YYYYMM')) 就医月数,
    round(count(distinct 身份证号 || to_char(门诊日期,'YYYYMMDD')) / count(distinct to_char(门诊日期,'YYYYMM')),1) 人月人次
from 模型_门诊诊次 where 机构编码 = 'H00000000000'
--and regexp_instr(门诊科室,'测试科室') > 0
group by 机构名称,姓名,身份证号,持证类别
order by 人月人次 desc
) a where rownum <=10;

 --就医人次汇总
SELECT 机构编码,机构名称,险种类别,持证类别,姓名,性别,年龄,身份证号,
    门诊号,门诊日期,门诊科室,门诊医生,疾病编码,疾病诊断,
    结算类别,结算日期,医疗金额,列支金额,基金支付,个账支付,现金支付
FROM 负荷_门诊就医 a where a.机构编码 = 'H00000000000' 
and a.身份证号 = '330182196004294039' and a.姓名 = '戴柏春'
order by 门诊日期;

 --就医项目汇总
select a.机构编码, a.机构名称, b.门诊科室, b.门诊医生, b.身份证号, b.姓名, a.收费项目类别 类别, a.国标名称 名称,
    sum(a.数量) 数量, sum(a.金额) 金额,
    count(distinct b.身份证号 || to_char(b.门诊日期,'YYYYMMDD')) 就医人次,
    count(distinct b.身份证号 || to_char(b.门诊日期,'YYYYMM')) 就医月数
from 负荷_门诊结算 a inner join 负荷_门诊就医 b on a.机构编码 = b.机构编码 and a.门诊号 = b.门诊号
where a.机构编码 = 'H00000000000' 
and b.身份证号 = '330182197211061910' and b.姓名 = '陶建辉'
group by a.机构编码, a.机构名称, b.门诊科室, b.门诊医生, b.身份证号, b.姓名, a.收费项目类别, a.国标名称
order by 身份证号,类别,名称;

 --项目费用明细
select a.机构编码, a.机构名称, b.门诊科室, b.门诊医生, b.身份证号, b.姓名, b.性别, b.年龄, b.门诊日期, b.疾病诊断,
    a.收费项目类别 类别, a.国标代码 代码,a.国标名称 名称, a.规格,
    a.频次, a.天数, a.剂量, a.数量, a.数量单位, a.单价, a.金额,
    a.费用发生日期 费用日期
from 负荷_门诊结算 a inner join 负荷_门诊就医 b on a.机构编码 = b.机构编码 and a.门诊号 = b.门诊号
where a.机构编码 = 'H00000000000' 
and b.身份证号 = '000000000000000000'
order by a.身份证号,a.费用发生日期;


