/*********************************************************************************************
脚本说明：以下脚本用于分析门诊项目排名，运行时应替换实际机构代码和名称
机构编码：H33018200950
机构名称：下涯卫生院
**********************************************************************************************/

 --项目费用明细
select a.机构编码, a.机构名称, b.门诊科室, b.门诊医生, b.身份证号, b.姓名, b.性别, b.年龄, b.门诊日期, b.门诊天数, b.疾病诊断,
    a.类别, a.代码,a.名称, a.规格, a.单位, a.单价, 
    a.人次, a.天数, a.频次, a.剂量, a.数量, a.金额 医疗金额, a.列支 医保支付,
    a.日期 费用日期
from 统计_门诊频度 a inner join 统计_门诊诊次 b on a.机构编码 = b.机构编码 and a.身份证号 = b.身份证号 and a.门诊日期 = b.门诊日期
where a.机构编码 = 'H33018200950' 
and a.名称 in ('丹红注射液')
order by a.身份证号,a.日期;
