/*********************************************************************************************
脚本说明：以下脚本用于分析住院就医人数、人次、费用等排名，运行时应替换实际机构代码和名称
机构编码：H00000000000
机构名称：测试医院
**********************************************************************************************/

-----------------------------------------------------------------------------------------------
--脚本：确定就医年度分段
select distinct to_char(住院日期,'YYYY') 就医年度  from 统计_住院诊次 where 机构编码 = 'H00000000000'
order by 就医年度

-----------------------------------------------------------------------------------------------
--脚本：住院人次排名
--说明：
-----------------------------------------------------------------------------------------------
select * from(
select 
    机构名称,
    姓名,
    身份证号,
    持证类别,
    count(distinct 身份证号 || to_char(住院日期,'YYYYMMDD')) 就医人次,
    count(distinct 身份证号 || to_char(住院日期,'YYYYMM')) 就医月数,
    round(count(distinct 身份证号 || to_char(住院日期,'YYYYMMDD')) / count(distinct 身份证号 || to_char(住院日期,'YYYYMM')),1) 人月人次
from 统计_住院诊次 where 机构编码 = 'H00000000000'
--and regexp_instr(住院科室,'测试科室') > 0
group by 机构名称,姓名,身份证号,持证类别
order by 就医人次 desc
) a where rownum <=100;

-----------------------------------------------------------------------------------------------
--脚本：项目人次排名
--说明：
-----------------------------------------------------------------------------------------------
select * from(
select 
    机构名称,
    名称,
    规格,
    sum(人次) 人次,
    sum(频次) 频次,
    sum(数量) 数量,
    sum(金额) 金额,
    count(distinct 身份证号 || to_char(住院日期,'YYYYMM')) 人月数,
    round(sum(人次) / count(distinct 身份证号 || to_char(住院日期,'YYYYMM')),1) 人月人次
from 统计_住院频度 a where 机构编码 = 'H00000000000'
--and exists (select 1 from 统计_住院诊次 b where a.机构编码 = b.机构编码 and a.身份证号 = b.身份证号 and a.住院日期 = b.住院日期 and regexp_instr(b.住院科室,'测试科室') > 0)
--and 类别 in ('西药费')
--and 类别 in ('成药费')
--and 类别 in ('草药费')
--and 类别 in ('材料费')
--and 类别 in ('化验费','病理费')
--and 类别 in ('检查费')
--and 类别 in ('护理费','注射费')
--and 类别 in ('诊查费','挂号费','一般诊疗费','吸氧费')
--and 类别 in ('物理治疗费','中医治疗费','中医论治费')
--and 类别 in ('精神治疗费')
and 类别 in ('手术费','麻醉费')
group by 机构名称,名称,规格
order by 人次 desc
) a where rownum <=100;


select distinct 类别 from 统计_住院频度 where 机构编码 = 'H00000000000'
