/*********************************************************************************************
脚本说明：以下脚本用于分析住院费用排名，运行时应替换实际机构代码和名称
机构编码：H00000000000
机构名称：测试医院
**********************************************************************************************/

--门诊就医明细
select a.机构编码, a.机构名称, a.门诊科室, a.门诊医生, a.身份证号, a.姓名, a.性别, a.年龄, a.门诊号, a.门诊日期, a.疾病诊断, a.次要诊断,
    a.医疗金额, a.列支金额, a.基金支付, a.个账支付, a.现金支付
from 负荷_门诊就医 a where a.机构编码 = 'H00000000000' and to_char(a.门诊日期,'YYYY') = '2025'
order by a.门诊号,a.门诊日期;

--门诊费用明细
SELECT a.机构编码,a.机构名称,a.身份证号,a.姓名,a.门诊号,
    b.项目代码,b.项目名称,b.国标代码,b.国标名称,b.规格,b.产地厂家,b.用法,b.剂量,b.剂量单位,
    b.频次,b.收费项目类别,b.收费项目等级,b.数量,b.数量单位,b.单价,b.金额,b.限价,b.自付比例,
    b.全自费金额,b.超限价金额,b.先行自付金额,b.费用发生日期,b.费用科室名称
FROM 负荷_门诊就医 a inner join 负荷_门诊结算 b on a.机构编码 = b.机构编码 and a.门诊号 = b.门诊号
where a.机构编码 = 'H00000000000' and to_char(a.门诊日期,'YYYY') = '2025'
order by a.门诊号,a.门诊日期,b.费用发生日期;

--住院就医明细
select a.机构编码, a.机构名称, a.住院科室, a.住院医生, a.身份证号, a.姓名, a.性别, a.年龄, a.住院号, a.入院日期, a.住院天数, a.疾病诊断, a.次要诊断,
    a.医疗金额, a.列支金额, a.基金支付, a.个账支付, a.现金支付
from 负荷_住院就医 a where a.机构编码 = 'H00000000000' and to_char(a.入院日期,'YYYY') = '2025'
order by a.住院号,a.入院日期;

--住院费用明细
SELECT a.机构编码,a.机构名称,a.身份证号,a.姓名,a.住院号,
    b.项目代码,b.项目名称,b.国标代码,b.国标名称,b.规格,b.产地厂家,b.用法,b.剂量,b.剂量单位,
    b.频次,b.收费项目类别,b.收费项目等级,b.数量,b.数量单位,b.单价,b.金额,b.限价,b.自付比例,
    b.全自费金额,b.超限价金额,b.先行自付金额,b.费用发生日期,b.费用科室名称
FROM 负荷_住院就医 a inner join 负荷_住院结算 b on a.机构编码 = b.机构编码 and a.住院号 = b.住院号
where a.机构编码 = 'H00000000000' and to_char(a.入院日期,'YYYY') = '2025'
order by a.住院号,a.入院日期,b.费用发生日期;

--住院占床数
select a.住院科室, trunc(b.费用发生日期) 住院日, count(distinct b.住院号 || to_char(b.费用发生日期,'YYYYMMDD')) 占床数
from 负荷_住院就医 a inner join 负荷_住院结算 b on a.机构编码 = b.机构编码 and a.住院号 = b.住院号
where a.机构编码 = 'H00000000000' and to_char(a.入院日期,'YYYY') in ('2023','2024','2025')
group by a.住院科室, trunc(b.费用发生日期) 
order by 住院科室,住院日;

 --低标住院
select 机构编码, 机构名称, 身份证号, 姓名, count(住院日期) 住院人次, count(distinct to_char('YYYY')) 就医年度
from
(
select to_char(a.住院日期,'YYYY') 就医年度,
    a.机构编码, a.机构名称, a.住院科室, a.住院医生, a.身份证号, a.姓名, a.性别, a.年龄, a.住院日期, a.住院天数, a.疾病诊断,
    a.医疗金额,
    nvl(b.化验金额,0) + nvl(b.检查金额,0) 检查化验金额,
    round((nvl(b.化验金额,0) + nvl(b.检查金额,0)) / a.医疗金额,2) 检查化验占比,
    round((nvl(b.西药金额,0) + nvl(b.成药金额,0) + nvl(b.草药金额,0)) / a.医疗金额,2) 药品占比
from 统计_住院诊次 a inner join 统计_住院结构 b on a.机构编码 = b.机构编码 and a.身份证号 = b.身份证号 and a.住院日期 = b.住院日期
where a.机构编码 = 'H00000000000' 
--and to_char(a.住院日期,'YYYY') = '2025'
--and a.住院天数 < 3
and round((nvl(b.化验金额,0) + nvl(b.检查金额,0)) / a.医疗金额,2) > 0.5
order by 身份证号,住院日期,检查化验占比 desc
)a
group by 机构编码, 机构名称, 身份证号, 姓名
order by 住院人次 desc;



