
delete from 字典_规则分类;
commit;

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','药品','超险种范围限定用药','排查不属于基本医疗保险目录内用药','限工伤保险用药|限生育保险用药');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','诊疗','超险种范围限定诊疗','排查不属于基本医疗保险目录内诊疗','限工伤保险诊疗|限生育保险诊疗');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','药品','超机构等级限定用药','排查不符合机构等级限定范围用药','限二级以上机构使用|限三级机构使用');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','诊疗','超机构等级限定诊疗','排查不符合机构等级限定范围诊疗','限二级以上机构开展|限三级机构开展');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','药品','超就医方式限定用药','排查不符合就医方式限定范围用药','限门诊使用|限住院使用');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','诊疗','超就医方式限定诊疗','排查不符合就医方式限定范围诊疗','限门诊开展|限住院开展');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','药品','超专科范围限定用药','排查不符合专科限定范围用药','限急诊使用|限营养专科使用|限精神心理专科使用');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','诊疗','超专科范围限定诊疗','排查不符合专科限定范围诊疗','限急诊开展|限营养专科开展|限精神心理专科开展');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','药品','超性别对象限定用药','排查不符合性别限定对象用药','限女性患者使用|限男性患者使用');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','诊疗','超性别对象限定诊疗','排查不符合性别限定对象诊疗','限女性患者开展|限男性患者开展');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','药品','超年龄对象限定用药','排查不符合年龄限定对象用药','限婴幼儿使用|限小儿使用|限成人使用');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','诊疗','超年龄对象限定诊疗','排查不符合年龄限定对象诊疗','限婴幼儿开展|限小儿开展|限成人开展');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','药品','超适应症限定用药','排查不符合适应症限定疾病用药','适用于某类疾病患者，某类对象慎用，患有某类疾病者禁用');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','诊疗','超适应症限定诊疗','排查不符合适应症限定疾病诊疗','适用于某类疾病患者，某类对象慎重开展，患有某类疾病者禁止开展');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付范围','药品','超阶梯限定用药','排查不符合阶梯限定方式用药','限二线用药');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','药品','超用量限定用药','排查超过用量限定用药','每日最大用量不超过300mg');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','诊疗','超数量限定诊疗','排查超过数量限定诊疗','每日最多不超过3次');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','药品','超疗程限定用药','排查超过疗程限定用药','每疗程用药不超过7天');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','诊疗','超疗程限定诊疗','排查超过疗程限定诊疗','每疗程治疗不超过7天');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','药品','超疗程限定用药','排查超过疗程限定用药','每疗程用药不超过7天');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','诊疗','超疗程限定诊疗','排查超过疗程限定诊疗','每疗程治疗不超过7天');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','药品','超额度限定用药','排查超过额度限定用药','每疗程医保支付不超过30000元');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','诊疗','超额度限定诊疗','排查超过额度限定诊疗','每疗程医保支付不超过30000元');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','诊疗','超人次限定诊疗','排查超过人次限定诊疗','每住院期间不超过1人次');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','诊疗','超频次限定诊疗','排查超过频次限定诊疗','每日不超过3次');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','药品','超加价标准药品','排查超过加价标准药品','零售价不超过采购价1.5倍');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('超支付标准','材料','超加价标准材料','排查超过加价标准材料','零售价不超过采购价1.25倍');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('重复计费','诊疗','同类项目重复','排查重复开展诊疗','A类项目不得与B类项目同日重复开展');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('重复计费','诊疗','加收项目重复','排查重复加收诊疗','A项目每次加收不超过1次');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('关联缺失','药品','关联操作缺失','排查缺失关联操作药品','适用于肠外营养');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('关联缺失','材料','关联操作缺失','排查缺失关联操作材料','适用于心内介入治疗');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('关联缺失','诊疗','关联操作缺失','排查缺失关联操作诊疗','适用于全身麻醉');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('串换项目','材料','串换材料项目','排查疑似串换材料','');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('串换项目','诊疗','串换诊疗项目','排查疑似串换诊疗','');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('虚记项目','材料','虚记材料消耗','排查疑似虚记材料消耗','');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('虚记项目','诊疗','虚记诊疗项目','排查疑似虚记诊疗项目','');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('过度诊疗','诊疗','每周过度诊疗','排查每周诊疗过度项目','');

insert into 字典_规则分类 (问题性质,项目来源,问题类型,规则用途,规则范式) 
values ('过度诊疗','诊疗','每月过度诊疗','排查每月诊疗过度项目','');

commit;
