
delete from 规则_诊疗重复;
commit;


Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315010470400','强直性脊柱炎多椎截骨矫正术(TB性脊柱畸形截骨矫正术)','(00331504007)','(植骨融合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315020080000','神经瘤切除术','(00331502005)','(神经吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315030050000','髋臼肿瘤切除及髋关节融合术','(00331512008)','(髋臼造盖成形)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315040010000','肘腕关节结核病灶清除术','(00331511001|00331517002)','(腕关节融合|肘关节融合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315040030000','髋关节结核病灶清除术','(003315030050)','(髋臼肿瘤切除及髋关节融合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315050210000','胫骨干骨折切开复位内固定术','(00331505039)','(腓骨骨折切开复位内固定)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315060010000','肩锁关节脱位切开复位内固定术','(0033150600102)','(肩锁关节脱位切开复位内固定术韧带重建术)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315060010100','肩锁关节脱位切开复位内固定术(肩锁关节成形)','(0033150600102)','(肩锁关节脱位切开复位内固定术韧带重建术)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315070100000','人工髌股关节置换术','(00331507007|00331507012)','(膝关节表面置换|髋关节表面置换)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315120120000','髌韧带成形术','(00331512012)','(髌韧带成形)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315190120000','指关节成形术','(00331517003|00331521019)','(副韧带挛缩切断|指间关节融合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315190120100','指关节成形术(趾关节)','(00331511005|00331521019)','(副韧带挛缩切断|趾间关节融合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210090000','指固有伸肌腱移位功能重建术','(00331502005|00331521029)','(肌腱吻合|神经吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210090100','指固有伸肌腱移位功能重建术(重建伸拇功能)','(00331502005|00331521029)','(肌腱吻合|神经吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210090200','指固有伸肌腱移位功能重建术(重建手指外展功能)','(00331502005|00331521029)','(肌腱吻合|神经吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210110000','屈肘功能重建术','(00331502005|00331502005|00331521029|00331521029)','(肌腱吻合|肌腱吻合|神经吻合|神经吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210120000','伸腕功能重建术','(00331502005|00331521029)','(肌腱吻合|神经吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210130000','伸指功能重建术','(00331502005|00331521029)','(肌腱吻合|神经吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210140000','屈指功能重建术','(00331502005|00331521029)','(肌腱吻合|神经吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210150000','拇指对掌功能重建术','(00331502005|00331521029)','(肌腱吻合|神经吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210370000','前臂神经探查游离神经移植术','(0033152103600|0033152103600)','(前臂神经探查吻合|前臂神经探查吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210370100','前臂神经探查游离神经移植术(桡神经)','(0033152103601)','(桡神经探查吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210370200','前臂神经探查游离神经移植术(正中神经)','(0033152103602)','(正中神经探查吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315210370300','前臂神经探查游离神经移植术(尺神经)','(0033152103603)','(尺神经探查吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003316020030000','胼胝病变切除修复术','(0031140003001)','(鸡眼刮除)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003316030220000','切(削)痂自体微粒皮移植术','(00331603016|00331603021|00331603027)','(异体皮打洞嵌植自体皮|异体皮移植|异体皮制备)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003316030220100','切(削)痂自体微粒皮移植术(自体皮浆移)','(00331603016|00331603021|00331603027)','(异体皮打洞嵌植自体皮|异体皮移植|异体皮制备)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003316030280000','带毛囊游离皮肤移植术','(00331604024)','(任意皮瓣形成)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003402000200000','运动疗法','(0034020002001|0034020002002|0034020002003|0034020002004|0034020002005|0034020002006|00340200030)','(步态平衡功能训练|关节活动度训练|呼吸训练|肌力训练|器械训练|全身肌力训练|徒手体操)','康复治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('004200000070000','骨折夹板外固定术','(00420000001)','(骨折手法整复)','中医治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('004200000070100','骨折夹板外固定术(复查调整)','(00420000001)','(骨折手法整复)','中医治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('333204000050000','经导管二尖瓣钳夹成型术','(0012040001101|00220302012|0032040000105)','(房间隔穿刺|临床操作的彩色多普勒超声引导|中心静脉穿刺置管)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('333206000120000','脑动脉腔内血栓取出术','(00320600005)','(经皮穿刺脑血管腔内溶栓)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('333316029010000','恶性软组织肿瘤广泛切除术','(00331202012)','(腹膜后淋巴结清扫)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332502019010000','白血病细胞常规化学染色','(002502010070000|002504010070000)','(白细胞粘附抑制试验|骨髓特殊染色及酶组织化学染色检查)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332502039010000','凝血功能常规检查','(002502030200000|002502030250000|002502030300000|002502030350000)','(活化部分凝血活酶时间测定APTT|凝血酶时间测定TT|血浆凝血酶原时间测定PT|血浆纤维蛋白原测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332503019020000','生化筛查常规检查','(002503010010000|002503010020000|002503020010000|002503030010000|002503030020000|002503030040000|002503040010000|002503040020000|002503040030000|002503050010000|002503050020000|002503050030000|002503050070000|002503070010000|002503070020000|002503070050000)','(肌酐测定|钾测定|氯测定|钠测定|尿素测定|葡萄糖测定|血清白蛋白测定|血清丙氨酸氨基转移酶测定|血清甘油三酯测定|血清高密度脂蛋白胆固醇测定|血清间接胆红素测定|血清尿酸测定|血清直接胆红素测定|血清总胆固醇测定|血清总胆红素测定|血清总蛋白测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332503019030000','急诊生化常规检查','(002503020010000|002503040010000|002503040020000|002503040030000|002503040040000|002503070010000|002503070020000)','(钙测定|肌酐测定|钾测定|氯测定|钠测定|尿素测定|葡萄糖测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332503029010000','胸(腹)水生化常规检查','(002503010010000|002503020010000|002503050230000|002503060050000)','(葡萄糖测定|乳酸脱氢酶测定|腺苷脱氨酶测定|血清总蛋白测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332503049010000','电解质测定','(002503040010000|002503040020000|002503040030000)','(钾测定|氯测定|钠测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332503109010000','甲状腺功能常规检查','(002503100010000|002503100100000|002503100110000|002503100130000|002503100140000)','(血清促甲状腺激素测定|血清甲状腺素T4测定|血清三碘甲状原氨酸T3测定|血清游离甲状腺素FT4测定|血清游离三碘甲状原氨酸FT3测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332503109020000','生殖激素常规检查','(002503100020000|002503100040000|002503100050000|002503100300000|002503100360000|002503100370000)','(雌二醇测定|血清促黄体生成素测定|血清促卵泡刺激素测定|血清泌乳素测定|孕酮测定|睾酮测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332504029010000','抗核抗体系列测定','(002504020020000|002504020030000|002504020030000|002504020030000|002504020030000|002504020030000|002504020030000|002504020060000)','(抗核抗体测定ANA|抗核提取物抗体测定抗ENA抗体|抗核提取物抗体测定抗JO－1|抗核提取物抗体测定抗SSB|抗核提取物抗体测定抗ScL-70|抗核提取物抗体测定抗Sm|抗核提取物抗体测定抗nRNP|抗双链DNA测定抗dsDNA)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332504040390000','肿瘤标志物检测','(002504040010000|002504040020000|002504040110000)','(癌胚抗原测定CEA|甲胎蛋白测定AFP|糖类抗原测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332508000020000','肝功能常规检查','(002503010010000|002503010020000|002503050010000|002503050020000|002503050030000|002503050070000|002503050080000|002503050090000|002503050110000)','(血清γ-谷氨酰基转移酶测定|血清白蛋白测定|血清丙氨酸氨基转移酶测定|血清间接胆红素测定|血清碱性磷酸酶测定|血清天门冬氨酸氨基转移酶测|血清直接胆红素测定|血清总胆红素测定|血清总蛋白测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332508000030000','肾功能常规检查','(002503070010000|002503070020000|002503070050000)','(肌酐测定|尿素测定|血清尿酸测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332508000040000','心肌酶谱常规检查','(002503050080000|002503060010000|002503060020000|002503060050000)','(乳酸脱氢酶测定|血清肌酸激酶－MB同工酶活性测定|血清肌酸激酶测定|血清天门冬氨酸氨基转移酶测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332508000060000','血脂常规检查','(002503030010000|002503030020000|002503030040000|002503030050000)','(血清低密度脂蛋白胆固醇测定|血清甘油三酯测定|血清高密度脂蛋白胆固醇测定|血清总胆固醇测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('332508000090000','乙肝三系检查','(002504030040000|002504030050000|002504030060000|002504030070000|002504030090000)','(乙型肝炎e抗体测定AntiHBe|乙型肝炎e抗原测定HBeAg|乙型肝炎表面抗体测定AntiHBs|乙型肝炎表面抗原测定HBsAg|乙型肝炎核心抗体测定Anti-HBc)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('331200','ICU单元治疗','(001201|001202|001204|001205|001206|001207|001208|001209|001210|001211|001212|001213|001214|001215|001216|001217)','(一般肛管排气|一般诊疗鼻饲管置管|一般诊疗导尿|一般诊疗灌肠|一般诊疗护理|一般诊疗换药|一般诊疗冷热湿敷|一般诊疗抢救|一般诊疗清创|一般诊疗胃肠减压|一般诊疗雾化吸入|一般诊疗物理降温|一般诊疗洗胃|一般诊疗引流管冲洗|一般诊疗注射|一般诊疗坐浴)','ICU');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331505','切开复位','(00330804044|00331502013|00331521036)','(前臂神经探查吻合|上肢血管探查|下肢神经探查吻合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('0031140004','烧伤冲洗清创术','(00311400056)','(烧伤换药)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00120100009','精神科监护','(00120100003|33120100035|33120100035)','(Ⅰ级护理|等级护理|等级护理)','精神治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00220201008','床旁B超检查','(00220201002)','(B超常规检查)','检查');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00220302006','四肢血管彩色多普勒超声','(00220301002)','(浅表器官彩色多普勒超声检查)','检查');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00220302011','腔内彩色多普勒超声检查','(00220301001)','(彩色多普勒超声常规检查)','检查');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00220600004','心脏彩色多普勒超声','(00220600001|00220600002)','(普通二维超声心动图|普通心脏M型超声检查)','检查');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00220800008','超声计算机图文报告','(00220800002)','(彩色打印照片)','检查');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00250101015','血细胞分析','(00250101002|00250101009)','(白细胞计数|红细胞计数)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00250102024','尿沉渣定量','(00250102023)','(尿沉渣镜检)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00250102035','尿液分析','(00250102006|00250102029|00250102034)','(尿沉渣白细胞分类|尿蛋白定量|尿红细胞位相)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00250201001','骨髓涂片细胞学检验','(00250201002|00250201003)','(骨髓巨核细胞计数|骨髓有核细胞计数)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00310100027','神经阻滞治疗','(00330100001)','(局部浸润麻醉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00310402022','前鼻孔填塞','(00310402002)','(前鼻镜检查)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00310403009','纤维喉镜检查','(00310402016)','(鼻咽部活检)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00310602006','血气分析','(00250101001|00250202016|00250302001|00250304004|00250304010|00250304010)','(钙测定|高铁血红蛋白还原试验|葡萄糖测定|血红蛋白测定|血清碳酸氢盐|血清碳酸氢盐)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00311300002','关节穿刺','(0031130000201|0033152301100)','(多头带包扎|关节腔减压)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00311300003','关节腔灌注治疗','(00311300002)','(关节穿刺)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00311503003','精神科监护','(00120100009)','(精神病护理)','精神治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00320200010','经皮动脉支架置入','(00320200009)','(经皮动脉内球囊扩张)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330100001','局部浸润麻醉','(00330100013|00330100014)','(气管插管|特殊方法气管插管)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330100003','椎管内麻醉','(00330100001)','(局部浸润麻醉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330100005','全身麻醉','(00310603002|00330100013)','(辅助通气|气管插管)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330100007','支气管内麻醉','(00330100013|00330100014)','(气管插管|特殊方法气管插管)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330100015','麻醉中监测','(00310601009|00310701018|00310701022|00310701025|00310702002)','(持续有创性血压监测|动脉内压力监测|二氧化碳反应曲线|心电监测|心率变异性分析)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330502009','鼓室成形','(00330502010)','(人工听骨听力重建)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330502011','经耳内镜鼓室探查','(00310401034|00310401035|00310401036|00310401038)','(电耳镜检查|耳纤维内镜检查|西格氏耳镜检查|硬性耳内镜检查)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330502014','单纯乳突凿开','(00330502011)','(经耳内镜鼓室探查)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330502015','完壁式乳突根治','(00330502011)','(经耳内镜鼓室探查)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330502016','开放式乳突根治','(00330502011)','(经耳内镜鼓室探查)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330502017','乳突改良根治','(00330502011)','(经耳内镜鼓室探查)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330601014','鼻中隔矫正','(00330601015)','(鼻中隔软骨取骨)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330602013','经鼻内镜鼻窦','(0033060201301|0033060201302|0033060201303)','(蝶窦|额窦|筛窦)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330606041','经口茎突过长切除','(00330610001)','(扁桃体切除)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330701001','经直达喉镜喉肿物摘除','(00310403009|00310403010|00310403011|00310403012|00310403013)','(喉动态镜检查|间接喉镜检查|纤维喉镜检查|支撑喉镜检查|直达喉镜检查)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00330701025','经支撑喉镜激光声带肿物切除','(00310403009|00310403010|00310403011|00310403012|00310403013)','(喉动态镜检查|间接喉镜检查|纤维喉镜检查|支撑喉镜检查|直达喉镜检查)','耳鼻喉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331501040','后路腰椎间盘镜椎间盘髓核摘除','(00331501036|00331501039|00331501039|00331501058)','(经皮激光腰椎间盘摘除|椎管扩大减压|椎间盘微创消融|椎间盘摘除)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331501052','脊柱椎间融合器植入植骨融合','(00330204001|00331501032)','(脊髓和神经根粘连松解|胸腰椎骨折切开复位内固定)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331501058','椎间盘微创消融术','(00331501039)','(椎间盘摘除)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331505002','肱骨近端骨折切开复位内固定','(00331521036)','(神经探查)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331505010','桡尺骨干骨折切开复位内固定','(00331505009)','(孟氏骨折切开复位内固定)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331506016','骨折外固定架固定','(00311300001)','(关节镜检查)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331506020','膝关节清理','(00311300004|00331506015)','(关节腔冲洗|膝关节单纯游离体摘除)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331507005','人工全髋关节置换','(00331502009|00331512008|00331513003)','(残端修整|周围神经嵌压松解|髋臼造盖成形)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331507007','人工膝关节表面置换','(00330804044|00331506016|00331506019|00331506020|00331506020|00331510007|00331510008|00331512010|00331512012)','(半月板切除|股骨下端截骨|股四头肌成形|上肢血管探查|膝关节关节滑膜切除清理|膝关节清理|膝关节清理|胫骨高位截骨|髌韧带成形)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331520003','手部外伤皮肤缺损游离植皮','(00331604024)','(任意皮瓣形成)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00331522008','肩袖破裂修补','(00331505002)','(肱骨近端骨折切开复位内固定)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00340100010','中频脉冲电治疗','(00420000013)','(中医定向透药疗法)','物理治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00340100017','超声波治疗','(0034010001702)','(超声药物透入)','物理治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00410000005','中药封包治疗','(00480000003)','(中药特殊调配)','中医治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00420000006','骨折外固定架固定','(00420000007)','(骨折夹板外固定)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00430000012','耳针','(0043000001201|0043000001202|0043000001203)','(磁珠压耳穴|耳穴埋针|耳穴压豆)','中医治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00430000014','针刺运动疗法','(00340200020|00430000001)','(普通针刺|运动疗法)','中医治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00440000001','灸法','(0044000000102|0044000000103|0044000000104)','(艾箱灸|艾柱灸|天灸)','中医治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00450000002','颈椎病推拿治疗','(00450000006)','(腰椎间盘突出推拿治疗)','中医治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('00480000006','中医辨证论治','(00110200001)','(诊查费)','中医治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('33250203901','凝血功能常规检查','(00250203066)','(血浆D-二聚体测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('33250301902','生化筛查常规检查','(33250800002|33250800004)','(肝功能常规检查|心肌酶谱常规检查)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('33250301903','急诊生化常规检查','(00250304004)','(钙测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('33250800002','肝功能常规检查','(00250301001|00250301002)','(血清白蛋白测定|血清总蛋白测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('33250800003','肾功能常规检查','(00250307028)','(血清胱抑素)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('33250800006','血脂常规检查','(00250303007)','(血清载脂蛋白AⅠ测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('33250800009','乙肝三系检查','(00250403004)','(乙型肝炎表面抗原测定)','化验');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('0022030100102','彩色多普勒超声常规检查(腹部)','(00220302004)','(门静脉系彩色多普勒超声)','检查');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('0033010000802','术后镇痛(分娩)','(00330100008)','(术后镇痛)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('002207000070000','心肌灌注超声检测','(00230400003|00230400004)','(负荷心肌灌注断层显象|静息心肌灌注断层显象)','B超');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003101000020000','特殊脑电图','(00310100001)','(脑电图)','脑电');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003101000020100','特殊脑电图(特殊电极(鼻咽或蝶骨或皮层等))','(00310100001)','(脑电图)','脑电');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003101000020200','特殊脑电图(特殊诱发)','(00310100001)','(脑电图)','脑电');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003101000030000','脑地形图','(00310100001)','(脑电图)','脑电');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003105110180000','显微根管治疗术','(0031051101801|0031051101802)','(根尖屏障制备|显微镜下复杂根管治疗)','口腔');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003105110250000','根管内固定术','(00310511016)','(根管预备)','口腔');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003106040070000','开胸胸腔病变活检','(003106040050000|003106040050000)','(胸腔穿刺|胸腔穿刺术)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003107020070000','永久起搏器安置术','(003107020100000)','(起搏器功能分析和随访)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003108000020000','骨髓活检术','(003108000010000|003108000010000)','(骨髓穿刺|骨髓穿刺术)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003109010060000','食管腔内支架置入术','(00310901008)','(食管狭窄扩张)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003110000160000','肾活检术','(003110000150000|003110000150000)','(肾穿刺|肾穿刺术)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003111000060000','睾丸阴茎海绵体活检术','(003111000060100|003111000060100)','(睾丸阴茎海绵体穿刺|睾丸阴茎海绵体穿刺术)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003111000130000','前列腺活检术','(003111000140000|003111000140000)','(前列腺穿刺|前列腺穿刺术)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003112010110000','宫颈内口探查术','(00311201010)','(宫颈扩张)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003112010530000','人工流产术','(00311201010)','(宫颈扩张)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003112020100000','新生儿换血术','(00311202008)','(脐静脉穿刺)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003114000460000','烧伤冲洗清创术','(00311400056)','(烧伤换药)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003205000020000','经皮冠状动脉腔内成形术(PTCA)','(00320500001|00320500001)','(冠状动脉造影|冠状动脉造影)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003205000030000','经皮冠状动脉内支架置入术(STENT)','(00320100004|00320500001)','(冠状动脉造影|经皮静脉球囊扩张)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003205000050000','高速冠状动脉内膜旋磨术','(00320100004|00320500001)','(冠状动脉造影|经皮静脉球囊扩张)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003205000070000','冠脉血管内超声检查术(IVUS)','(00320500001)','(冠状动脉造影)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003205000110000','经皮冠状动脉内溶栓术','(00320500001)','(冠状动脉造影)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003205000120000','经皮激光心肌血管重建术(PMR)','(00320500001)','(冠状动脉造影)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003205000130000','冠状动脉内超声溶栓术','(00320500001)','(冠状动脉造影)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003205000140000','冠脉内局部放射治疗术','(00320500001)','(冠状动脉造影)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003205000150000','冠脉内局部药物释放治疗术','(00320500001)','(冠状动脉造影)','介入治疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003301000030000','椎管内麻醉','(0033010000502)','(全身麻醉静脉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003301000050000','全身麻醉','(0033010000502)','(全身麻醉静脉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003301000050100','全身麻醉(吸入)','(0033010000502)','(全身麻醉静脉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003301000050300','全身麻醉(吸静复合)','(0033010000502)','(全身麻醉静脉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003301000050400','全身麻醉(靶控输入)','(0033010000502)','(全身麻醉静脉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003301000070000','支气管内麻醉','(0033010000502)','(全身麻醉静脉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003301000080000','术后镇痛','(0033010000502)','(全身麻醉静脉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003301000080200','术后镇痛(分娩)','(0033010000502)','(全身麻醉静脉)','麻醉');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003302010210000','颅内蛛网膜囊肿分流术','(0033020102704)','(蛛网膜囊肿)','神经外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003302020080000','面神经简单修复术','(003302020130000)','(面神经周围神经移植)','神经外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003302020110000','面神经松解减压术','(003306050270200)','(腮腺浅叶肿物切除)','神经外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003302020170000','经乙状窦后进路神经切断术','(003302020020)','(三叉神经周围支切断)','神经外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003302030050000','颅内动静脉畸形切除术','(00330201015)','(颅内血肿清除)','神经外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003302030130000','颞肌颞浅动脉贴敷术','(003302030110100)','(颈总动脉大脑中动脉吻合)','神经外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003303000120000','甲状腺癌扩大根治术','(003303000020000|00330300008)','(甲状旁腺腺瘤切除|甲状腺部分切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003303000210000','肾上腺切除术','(00331101014)','(肾囊肿切除)','泌尿外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003304010180000','睑缘粘连术','(003304030010000)','(睑球粘连分离)','眼科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003304020080000','鼻泪道再通术','(003304020080200)','(鼻泪道再通)','眼科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003304020090000','泪道成形术','(00310300105)','(泪小点扩张)','眼科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003304040100000','角膜移植术','(003304040100)','(角膜移植)','眼科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003304040100001','角膜移植术(干细胞移植加收)','(003304040100)','(角膜移植)','眼科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003305020090000','鼓室成形术','(00330502002|00330502003|00330502011)','(鼓膜切开|鼓膜修补|鼓室探查)','耳鼻喉科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003305020110000','经耳内镜鼓室探查术','(00330502002|00330502002|00330502011)','(鼓膜切开|鼓膜切开|鼓室探查)','耳鼻喉科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003305020180000','上鼓室鼓窦凿开术','(00330502011)','(鼓室探查)','耳鼻喉科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003305020190000','经耳脑脊液耳漏修补术','(00330502011|00330502014)','(鼓室探查|乳突凿开)','耳鼻喉科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003305030190000','经乳突硬膜外脓肿引流术','(00330502015|00330502016)','(乳突根治|乳突根治)','耳鼻喉科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003306040330000','牙周骨成形手术','(00330604010|00330604010|00330604029)','(牙槽骨修整|牙槽骨修整|牙龈翻瓣)','口腔科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003306040340000','牙周骨成形手术','(00330604010|00330604010)','(牙槽骨修整|牙槽骨修整)','口腔科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003306040400000','引导性牙周组织再生术','(00330604029)','(牙龈翻瓣)','口腔科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003306110020000','经颈侧进路鼻咽肿瘤切除术','(00331602007)','(纤维血管瘤)','耳鼻喉科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003307030050000','肋骨骨髓病灶清除术','(00330703006)','(肋骨切除)','心胸外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003307030120000','胸壁肿瘤切除术','(00330703013)','(胸壁缺损修复)','心胸外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003307030180000','脓胸大网膜填充术','(00330804065)','(大网膜游离移植)','心胸外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003308010060000','三尖瓣下移畸形矫治术(Ebstein畸形矫治术)','(00330801017|00330801019)','(房间隔缺损修补|三尖瓣成形)','心胸外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003308010120000','肺动脉瓣狭窄矫治术','(00330801019|00330802044)','(三尖瓣成形|右室流出道扩大)','心胸外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003308010220000','法鲁氏三联症根治术','(00330801017|00330802044)','(房间隔缺损修补|右室流出道扩大)','心胸外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003308010260000','复合性先天性心脏畸形矫治术','(00330801019|0033080102|00330802018)','(部分型心内膜垫缺损矫治|法鲁氏四联症根治|右室双出口矫治)','心胸外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003308010270000','三房心矫治术','(00330801017)','(房间隔缺损修补)','心胸外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003308030010000','经胸腔镜心包活检术','(003107020220000|003107020220100)','(心包穿刺|心包穿刺术引流)','心胸外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003308030010000','经胸腔镜心包活检术','(003107020220000|003107020220100)','(心包穿刺术|心包穿刺术引流)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003309000160000','脾部分切除术','(00330900017)','(脾修补)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003309000180000','脾切除术','(00330900017)','(脾修补)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003309000180100','脾切除术(副脾切除术)','(00330900017)','(脾修补)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003309000180200','脾切除术(胰尾切除术)','(00330900017)','(脾修补)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310010230000','贲门癌扩大根治术','(00330900018|00331002003|00331002004)','(近端胃大部切除|脾切除|远端胃大部切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310020060000','胃癌扩大根治术','(00330900018|00331002003|00331002004|00331002005)','(近端胃大部切除|脾切除|胃癌根治|远端胃大部切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310030110000','肠造瘘还纳术','(00331003023)','(肠吻合)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310030200000','结肠癌根治术','(00331003018)','(结肠切除吻合)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310050020000','开腹肝活检术','(003109050030000|003310050020100)','(肝穿刺|开腹肝活检术穿刺)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310050020000','开腹肝活检术','(003109050030000|003310050020100)','(肝穿刺术|开腹肝活检术穿刺)','一般诊疗');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310050180000','肝移植术','(00331005015)','(肝切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310060040000','高位胆管癌根治术','(00331005015)','(肝切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310080260000','门体静脉断流术','(00330900018)','(脾切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310080260100','经腹门奇静脉断流术','(00330900018)','(脾切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003310080260100','门体静脉断流术(经网膜静脉门静脉测压术)','(00330900018)','(脾切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003311030080000','膀胱再造术','(00331103006)','(膀胱全切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003311030090000','回肠膀胱术','(00331003022)','(阑尾切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003311030090100','回肠膀胱术(结肠)','(00331003022)','(阑尾切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003311030100000','可控性回肠膀胱术','(00331003022)','(阑尾切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003311030100100','可控性回肠膀胱术(结肠)','(00331003022)','(阑尾切除)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003311030120000','直肠膀胱术','(00331003017)','(结肠造瘘)','普通外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003311040130000','尿道重建术','(00331103007)','(膀胱尿道全切除)','泌尿外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003311040180000','尿道瘘修补术','(0033110300502)','(膀胱造瘘)','泌尿外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003312020050000','高位隐睾下降固定术','(00331008001)','(腹股沟疝修补)','泌尿外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003312020080000','睾丸附件扭转探查术','(00331202006)','(睾丸鞘膜翻转)','泌尿外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003312020100000','睾丸固定术','(00331008005)','(腹壁切口疝修补)','泌尿外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003312040100000','阴茎重建成形术','(00331204012)','(阴茎假体置放)','泌尿外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003312040110000','阴茎再造术','(00331204012)','(阴茎假体置放)','泌尿外科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003313010060000','卵巢癌根治术','(00331003022|00331303015|00331303017)','(广泛性子宫切除+盆腹腔淋巴结清除|阑尾切除|全子宫+双附件切除)','妇科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003313030280000','根治性宫颈切除术','(00330900006)','(经腹腔镜盆腔淋巴结清扫)','妇科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003313040150000','全阴道切除术','(00331303013)','(全子宫切除)','妇科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315010360000','椎管扩大减压术','(003315010050000)','(椎板切除减压)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315010360100','椎管扩大减压术(多节段椎管狭窄减压)','(003315010050000)','(椎板切除减压)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315010470000','强直性脊柱炎多椎截骨矫正术','(00331501052)','(植骨融合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315010470200','强直性脊柱炎多椎截骨矫正术(先天性脊柱畸形截骨矫正术)','(00331501052)','(植骨融合)','骨科');

Insert into 规则_诊疗重复 (主项编码,主项名称,子项编码,子项名称,领域标识) 
values ('003315010470300','强直性脊柱炎多椎截骨矫正术(创伤性脊柱畸形截骨矫正术)','(00331501052)','(植骨融合)','骨科');

commit;
