
delete from 规则_材料关联;
commit;


Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','ACD','(00311000006)','(血液透析)','血液透析');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','瓣夹','(3332040000500)','(二尖瓣钳夹成型)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','瓣膜','(0033080100)','(瓣替换)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','导管','(0031070202|00320100008|003202000|00331201007)','(经皮静脉内溶栓|气囊扩张|球囊扩张|心导管检查术)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','导丝','(003109050)','(支架置入)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','管路','(00310800007|00310800008)','(血浆置换|自体血回输)','血液透析');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','喉罩','(00330100005)','(全身麻醉)','麻醉');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','滤网','(00320100003)','(滤网置入)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','膜肺','(00330803025)','(人工膜肺)','体外循环');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','球囊','(00320200009)','(球囊扩张术)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','栓塞','(003204)','(心血管介入治疗)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','水囊','(00311201054)','(水囊引产)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','银夹','(00330201)','(脑部手术)','神经外科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','支架','(0032010000|00320200010)','(动脉支架置入|支架置入)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','J形管','(00311000027)','(输尿管支架)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','瓣膜刀','(003308)','(旁路移植)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','鼻胆管','(00310905012)','(鼻胆管引流)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','鼻导管','(001203000010000)','(氧气吸入)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','鼻胰管','(00331007012)','(囊肿内引流术)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','闭合器','(003204)','(心血管介入治疗)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','超滤器','(00311000006)','(血液透析)','血液透析');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','成形器','(00331501059)','(椎体成形)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','穿刺针','(0012040001|00120400012|003101000160|003101000170|003101000190|003106040050|003109050030|003110000150)','(侧脑室穿刺|动脉穿刺|肝穿刺|静脉穿刺置管|肾穿刺|胸腔穿刺|腰椎穿刺|硬脑膜下穿刺)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','传感器','(00310702001|00310702002|00310702003)','(有创性心内电生理|有创性血流|有创性血压)','麻醉');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','传感器','(00310702007)','(起搏器安置)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','打孔器','(0033080200)','(冠状动脉搭桥)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','弹簧圈','(00320200007)','(动脉栓塞)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','分离器','(00330100017)','(体外循环)','体外循环');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','分离器','(00311000006|00311000006)','(血液透析|血液透析)','血液透析');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','分流铨','(00330802003)','(冠状动脉搭桥)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','封堵器','(003204)','(心血管介入治疗)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','缝合器','(003204)','(心血管介入治疗)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','辅助泵','(0033080302)','(辅助泵安装)','体外循环');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','盖髓剂','(00310511011)','(盖髓)','口腔科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','骨水泥','(00331501|00331505)','(脊柱骨关节手术|四肢骨折手术)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','过滤器','(00330100017)','(体外循环)','体外循环');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','过滤器','(00311000006)','(血液透析)','血液透析');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','化疗泵','(00331005008)','(化疗泵置放)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','换能器','(00310702001|00310702002|00310702003)','(有创性心内电生理|有创性血流|有创性血压)','麻醉');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','活检器','(00311300012)','(骨穿刺)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','活检针','(002703000010)','(穿刺组织活检)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','扩张器','(00331304003|003316030450)','(皮肤扩张|阴道扩张)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','来复锯','(00331507)','(关节置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','滤过器','(00310603001)','(呼吸机辅助)','麻醉');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','起搏器','(00310702007)','(起搏器安置)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','切割头','(00330406017)','(玻璃体切割)','眼科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','取石篮','(00311000026)','(碎石取石术)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','圈套器','(003109)','(肠镜检查)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工肝','(00310905023)','(人工肝治疗)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工喉','(00330701007)','(发音管安装)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','射频针','(00340100014)','(射频电疗)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','肾网袋','(00331102002)','(肾盂成形)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','碎石器','(00311000026)','(碎石取石术)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','投药泵','(00330100018)','(植入式给药装置置入)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','铣刀头','(0033150700)','(关节置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','细胞刷','(002702000040600)','(脱落细胞学检查)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','心包片','(00330801017)','(缺损修补)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','造瘘管','(00331002009)','(胃肠造瘘术)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','张力环','(00330406020)','(晶体张力环置入)','眼科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','支架管','(00311000027)','(输尿管支架置入)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','抓捕器','(003201000120)','(血管异物取出)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','转流泵','(00330100017|00330803025)','(人工膜肺|体外循环)','体外循环');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','子宫托','(00311201012)','(子宫托治疗)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','煅烧骨','(00330604008)','(牙再植术)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','剥脱导管','(00330804062)','(剥脱术)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','测压导管','(00310702001|00310702002)','(有创性血流动力|有创性血压)','麻醉');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','动脉瘤夹','(00330203001)','(动脉瘤夹闭)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','给药装置','(00330100018)','(植入式给药装置置入)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','冠脉胸撑','(00320500003)','(冠状动脉内支架置入)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','虹膜拉钩','(003304060)','(白内障)','眼科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','静脉导管','(00120400011|00311202008)','(脐静脉穿刺|中心静脉穿刺置管)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','离心泵头','(00330100017)','(体外循环)','体外循环');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','颅骨修补','(0033020100900)','(颅骨修补)','神经外科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','漂浮导管','(00310701024|00310702001)','(心房压力监测|血流动力学监测)','体外循环');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','气切套管','(00330701005)','(气管切开)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','热活检钳','(00310903)','(经内镜检查)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工晶体','(00330406006)','(人工晶体植入)','眼科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工血管','(003308)','(人工血管)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工硬膜','(00330201)','(颅脑手术)','神经外科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工椎体','(0033150106)','(人工椎体置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','溶栓导管','(00320100008)','(经皮静脉内溶栓)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','射频导管','(00310702004)','(射频消融)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','输注管路','(00120800002)','(营养治疗)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','牙弓夹板','(00310511011)','(正畸治疗)','口腔科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','移植材料','(0033060802)','(异种骨移植)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','硬膜修补','(003302010)','(硬膜下)','神经外科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','膜式氧合器','(00330803025)','(人工膜肺)','体外循环');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工半骨盆','(00331501016)','(半骨盆置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工股骨头','(00331507006)','(人工股骨头置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工虹膜隔','(0033040500600)','(虹膜隔植入)','眼科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工肱骨头','(00331507002)','(肱骨头置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','温度传感器','(00310701022)','(体温监测)','麻醉');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','压力传感器','(00310702002)','(持续有创性血压监测)','麻醉');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','黏膜切开刀','(00310903010|00310903010)','(肠镜特殊治疗|胃镜特殊治疗)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','Omaya|欧玛亚','(00330201019)','(脑室分流)','神经外科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','括约肌切开刀','(0033100601)','(括约肌切开)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','导管|输送导管','(003204)','(心血管介入治疗)','介入治疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','灌注管|灌注装置','(00330100017)','(体外循环)','体外循环');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','疝补片|人工补片','(0033100800)','(疝修补)','一般诊疗');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','气管导管|气管插管','(00330100013|00330100014)','(气管插管|特殊方法气管插管)','麻醉');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工关节|人工踝关节','(00331507009)','(踝关节置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工关节|人工全髋关节','(00331507005|00331507005)','(全髋关节置换|髋关节置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工关节|人工髌股关节','(00331507010)','(髌股关节置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('C','人工关节|人工肘关节及配件','(00331507003)','(人工肘关节置换)','骨科材料');

Insert into 规则_材料关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('c','人工关节|人工膝关节','(00331507007)','(膝关节表面置换)','骨科材料');

commit;
