delete from 规则_材料虚记;
commit;

Insert into "规则_材料虚记" ("主项编码","主项名称","排查数量","领域标识") values ('C140807000','凝固材料',3,null);
Insert into "规则_材料虚记" ("主项编码","主项名称","排查数量","领域标识") values ('C140808022','止血夹',5,null);
Insert into "规则_材料虚记" ("主项编码","主项名称","排查数量","领域标识") values ('C140807274','缝合针',5,null);
Insert into "规则_材料虚记" ("主项编码","主项名称","排查数量","领域标识") values ('C140805186','凝固材料',3,null);
Insert into "规则_材料虚记" ("主项编码","主项名称","排查数量","领域标识") values ('C140806187','缝合器',2,null);
Insert into "规则_材料虚记" ("主项编码","主项名称","排查数量","领域标识") values ('C140202259','胶片',3,null);
Insert into "规则_材料虚记" ("主项编码","主项名称","排查数量","领域标识") values ('C1408','缝线',5,null);
commit;
