/*********************************************************************************************
脚本说明：以下脚本用于将负荷数据归档，运行时请替换实际的机构编码、机构名称和行政区划
执行位置：脚本应在‘tar’用户空间执行
机构编码：H00000000000
机构名称：测试医院
行政区划：某区
档案编号：编写档案编号，列于下表
JDZJ20240620    2024年6月30日某区专检
**********************************************************************************************/

--*******************************************************************************************--
--脚本：创建负荷表的数据链接
create database link medi_link connect to medi identified by abc 
using '(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1522))(CONNECT_DATA=(SERVICE_NAME=ordw)))';

--*******************************************************************************************--
--脚本：归档机构摘要记录
delete from 归档_机构摘要 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_机构摘要
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_机构摘要@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档门诊就医记录
delete from 归档_门诊就医 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_门诊就医
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_门诊就医@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档门诊结算记录
delete from 归档_门诊结算 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_门诊结算
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_门诊结算@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档门诊处方记录
delete from 归档_门诊处方 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_门诊处方
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_门诊处方@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档门诊手术记录
delete from 归档_门诊手术 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_门诊手术
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_门诊手术@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档门诊麻醉记录
delete from 归档_门诊麻醉 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_门诊麻醉
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_门诊麻醉@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档住院就医记录
delete from 归档_住院就医 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_住院就医
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_住院就医@medi_link A where 机构编码 = 'H00000000000';
commit;
 
--*******************************************************************************************--
--脚本：归档住院结算记录
delete from 归档_住院结算 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_住院结算
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_住院结算@medi_link A where 机构编码 = 'H00000000000';
commit;
  
--*******************************************************************************************--
--脚本：归档住院医嘱记录
delete from 归档_住院医嘱 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_住院医嘱
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_住院医嘱@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档住院手术记录
delete from 归档_住院手术 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_住院手术
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_住院手术@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档住院麻醉记录
delete from 归档_住院麻醉 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_住院麻醉
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_住院麻醉@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档检查登记记录
delete from 归档_检查登记 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_检查登记
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_检查登记@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档检查报告记录
delete from 归档_检查报告 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_检查报告
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_检查报告@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档化验登记记录
delete from 归档_化验登记 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_化验登记
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_化验登记@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档门诊化验记录
delete from 归档_化验报告 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_化验报告
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_化验报告@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档药库结转记录
delete from 归档_药库结转 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_药库结转
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_药库结转@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档药库消耗记录
delete from 归档_药库消耗 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_药库消耗
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_药库消耗@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档药房结转记录
delete from 归档_药房结转 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_药房结转
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_药房结转@medi_link A where 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：归档药房消耗记录
delete from 归档_药房消耗 where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

insert into 归档_药房消耗
select 'JDZJ20240620' 档案编号, '某区' 行政区划, a.* from 负荷_药房消耗@medi_link A where 机构编码 = 'H00000000000';
commit;


