/*********************************************************************************************
脚本说明：以下脚本用于分析住院就医人数、人次、费用等结构，运行时应替换实际机构代码和名称
机构编码：H00000000000
机构名称：测试医院
**********************************************************************************************/

-----------------------------------------------------------------------------------------------
--脚本：确定就医年度分段
select distinct to_char(住院日期,'YYYY') 就医年度  from 模型_住院诊次 where 机构编码 = 'H00000000000'
order by 就医年度


-----------------------------------------------------------------------------------------------
--脚本：汇总年度就医人数
--说明：
-----------------------------------------------------------------------------------------------
select 
    机构编码,
    机构名称,
    to_char(住院日期,'YYYY') 就医年度,
    count(distinct 身份证号) as 就医人数 
from 模型_住院诊次 where 机构编码 = 'H00000000000'
group by 机构编码,机构名称,to_char(住院日期,'YYYY')
order by 就医年度;

-----------------------------------------------------------------------------------------------
--脚本：汇总年度险种人数
--说明：
-----------------------------------------------------------------------------------------------
select 
    机构编码,
    机构名称,
    to_char(住院日期,'YYYY') 就医年度,
    险种类别,
    count(distinct 身份证号) as 就医人数 
from 模型_住院诊次 where 机构编码 = 'H00000000000'
group by 机构编码,机构名称,to_char(住院日期,'YYYY'),险种类别
order by 险种类别，就医年度;

-----------------------------------------------------------------------------------------------
--脚本：汇总年度特殊人群人数
--说明：
-----------------------------------------------------------------------------------------------
select 
    机构编码,
    机构名称,
    to_char(住院日期,'YYYY') 就医年度,
    持证类别,
    count(distinct 身份证号) as 就医人数 
from 模型_住院诊次 where 机构编码 = 'H00000000000'
group by 机构编码,机构名称,to_char(住院日期,'YYYY'),持证类别
order by 持证类别，就医年度;

-----------------------------------------------------------------------------------------------
--脚本：汇总年度性别人数
--说明：
-----------------------------------------------------------------------------------------------
select 
    机构编码,
    机构名称,
    to_char(住院日期,'YYYY') 就医年度,
    性别,
    count(distinct 身份证号) as 就医人数 
from 模型_住院诊次 where 机构编码 = 'H00000000000'
group by 机构编码,机构名称,to_char(住院日期,'YYYY'),性别
order by 性别，就医年度;

-----------------------------------------------------------------------------------------------
--脚本：汇总年度年龄人数
--说明：
-----------------------------------------------------------------------------------------------
select 
    机构编码,
    机构名称,
    to_char(住院日期,'YYYY') 就医年度,
    年龄,
    count(distinct 身份证号) as 就医人数 
from 模型_住院诊次 where 机构编码 = 'H00000000000'
group by 机构编码,机构名称,to_char(住院日期,'YYYY'),年龄
order by 年龄，就医年度;

-----------------------------------------------------------------------------------------------
--脚本：汇总年度人次总额
--说明：
-----------------------------------------------------------------------------------------------
select
    机构编码,
    机构名称,
    to_char(住院日期,'YYYY') 就医年度,
    count(distinct 身份证号) as 就医人数,
    count(distinct 身份证号 || to_char(住院日期,'yyyymmdd')) as 就医人次,
    sum(住院天数) 床日数,
    sum(医疗金额) as 医疗金额,
    sum(基金支付) as 基金支付,
    sum(个账支付) as 个账支付
from 模型_住院诊次 where 机构编码 = 'H00000000000'
group by 机构编码,机构名称,to_char(住院日期,'YYYY')
order by 就医年度;

-----------------------------------------------------------------------------------------------
--脚本：汇总年度费用分量
--说明：
-----------------------------------------------------------------------------------------------
select
    机构编码,
    机构名称,
    to_char(住院日期,'YYYY') 就医年度,
    sum(医疗金额) as 医疗金额
from 模型_住院诊次 where 机构编码 = 'H00000000000'
group by 机构编码,机构名称,to_char(住院日期,'YYYY')
order by 就医年度;

select 
    机构编码,
    机构名称,
    to_char(住院日期,'YYYY') 就医年度,
    sum(床位金额) 床位金额,
    sum(诊查金额) 诊查金额,
    sum(护理金额) 护理金额,
    sum(化验金额) 化验金额,
    sum(检查金额) 检查金额,
    sum(一般诊疗金额) 一般诊疗金额,
    sum(手术麻醉金额) 手术麻醉金额,
    sum(介入治疗金额) 介入治疗金额,
    sum(放射治疗金额) 放射治疗金额,
    sum(物理治疗金额) 物理治疗金额,
    sum(中医治疗金额) 中医治疗金额,
    sum(康复治疗金额) 康复治疗金额,
    sum(精神治疗金额) 精神治疗金额,
    sum(西药金额) 西药金额,
    sum(成药金额) 成药金额,
    sum(草药金额) 草药金额,
    sum(材料金额) 材料金额,
    sum(其他金额) 其他金额
from 模型_住院结构 where 机构编码 = 'H00000000000'
group by 机构编码,机构名称,to_char(住院日期,'YYYY')
order by 就医年度;

