/*********************************************************************************************
脚本说明：以下脚本用于将负荷数据从归档库中恢复，运行时请替换实际的机构编码、机构名称和行政区划
执行位置：脚本应在‘medi’用户空间执行
机构编码：H00000000000
机构名称：测试医院
行政区划：某区
档案编号：编写档案编号，列于下表
JDZJ20240620    2024年6月30日某区专检
**********************************************************************************************/

--*******************************************************************************************--
--脚本：创建负荷表的数据链接
create database link tar_link connect to tar identified by abc 
using '(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1522))(CONNECT_DATA=(SERVICE_NAME=ordw)))';

--*******************************************************************************************--
--脚本：恢复机构摘要记录
delete from 负荷_机构摘要 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_机构摘要
SELECT "机构编码","机构名称","机构性质","机构等级","机构类型","核定床位","定点开始日期","定点停止日期" 
FROM "归档_机构摘要"@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复门诊就医记录
delete from 负荷_门诊就医 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_门诊就医
SELECT "机构编码","机构名称","险种类别","参保区划","姓名","性别","年龄","身份证号","门诊号","门诊日期","门诊科室","门诊医生","疾病编码","疾病诊断","次要诊断","结算流水号","结算类别","结算日期","医疗金额","列支金额","基金支付","个账支付","现金支付","机构等级" 
FROM 归档_门诊就医@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复门诊结算记录
delete from 负荷_门诊结算 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_门诊结算
SELECT "机构编码","机构名称","险种类别","身份证号","人员姓名","门诊号","处方号","处方组号","项目代码","项目名称","国标代码","国标名称","商品名","规格","产地厂家","用法","剂量","剂量单位","频次","天数","次数","收费项目类别","收费项目等级","医疗属性类别","数量","数量单位","单价","金额","限价","自付比例","全自费金额","超限价金额","先行自付金额","费用发生日期","费用科室名称","结算流水号" 
FROM 归档_门诊结算@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复门诊处方记录
delete from 负荷_门诊处方 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_门诊处方
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","门诊号","处置类型","处方号","处方组号","药品代码","药品名称","药品规格","处方用法","处方剂量","剂量单位","处方频次","处方天数","数量","数量单位","单价","金额","处方开具日期","处方科室名称" 
FROM 归档_门诊处方@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复门诊手术记录
delete from 负荷_门诊手术 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_门诊手术
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","门诊号","门诊科室名称","疾病诊断名称","手术日期","手术开始时间","手术结束时间","手术科室名称","手术者姓名","手术操作编码","手术操作名称","主要手术","手术等级","切口类型","愈合类型" 
FROM 归档_门诊手术@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复门诊麻醉记录
delete from 负荷_门诊麻醉 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_门诊麻醉
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","门诊号","门诊科室名称","疾病诊断名称","麻醉日期","麻醉开始时间","麻醉结束时间","麻醉科室名称","麻醉者姓名","麻醉方式编码","麻醉方式名称","麻醉等级","术后镇痛方式" 
FROM 归档_门诊麻醉@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复住院就医记录
delete from 负荷_住院就医 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_住院就医
SELECT "机构编码","机构名称","险种类别","参保区划","姓名","性别","年龄","身份证号","住院号","入院日期","出院日期","住院天数","住院科室","住院医生","疾病编码","疾病诊断","次要诊断","结算流水号","结算类别","结算日期","医疗金额","列支金额","基金支付","个账支付","现金支付","机构等级" 
FROM 归档_住院就医@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;
 
--*******************************************************************************************--
--脚本：恢复住院结算记录
delete from 负荷_住院结算 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_住院结算
SELECT "机构编码","机构名称","险种类别","身份证号","人员姓名","住院号","医嘱号","医嘱组号","项目代码","项目名称","国标代码","国标名称","商品名","规格","产地厂家","用法","剂量","剂量单位","频次","天数","次数","收费项目类别","收费项目等级","医疗属性类别","数量","数量单位","单价","金额","限价","自付比例","全自费金额","超限价金额","先行自付金额","费用发生日期","费用科室名称","结算流水号" 
FROM 归档_住院结算@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复住院医嘱记录
delete from 负荷_住院医嘱 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_住院医嘱
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","住院号","医嘱类型","医嘱号","医嘱组号","医嘱代码","医嘱名称","医嘱规格","医嘱用法","医嘱剂量","剂量单位","医嘱频次","医嘱天数","数量","数量单位","单价","金额","医嘱开始日期","医嘱停止日期","医嘱科室名称","开立医生姓名" 
FROM 归档_住院医嘱@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复住院手术记录
delete from 负荷_住院手术 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_住院手术
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","住院号","住院科室名称","疾病诊断名称","手术日期","手术开始时间","手术结束时间","手术科室名称","手术者姓名","手术操作编码","手术操作名称","主要手术","手术等级","切口类型","愈合类型" 
FROM 归档_住院手术@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复住院麻醉记录
delete from 负荷_住院麻醉 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_住院麻醉
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","住院号","住院科室名称","疾病诊断名称","麻醉日期","麻醉开始时间","麻醉结束时间","麻醉科室名称","麻醉者姓名","麻醉方式编码","麻醉方式名称","麻醉等级","术后镇痛方式","麻醉复苏开始时间","麻醉复苏结束时间" 
FROM 归档_住院麻醉@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复检查登记记录
delete from 负荷_检查登记 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_检查登记
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","就医方式","就医号","就医科室名称","疾病诊断名称","检查登记日期","检查科室名称","检查者姓名","检查项目编码","检查项目名称","是否外送"
FROM 归档_检查登记@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复检查报告记录
delete from 负荷_检查报告 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_检查报告
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","就医方式","就医号","就医科室名称","疾病诊断名称","检查报告时间","检查科室名称","检查者姓名","检查部位","检查方法","检查报告诊断","影像编号","检查报告单位"
FROM 归档_检查报告@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复化验登记记录
delete from 负荷_化验登记 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_化验登记
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","就医方式","就医号","就医科室名称","疾病诊断名称","检验登记日期","检验科室名称","检验者姓名","检验项目编码","检验项目名称","是否外送"
FROM 归档_化验登记@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复化验报告记录
delete from 负荷_化验报告 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_化验报告
SELECT "机构编码","机构名称","身份证号","姓名","性别","年龄","就医方式","就医号","就医科室名称","疾病诊断名称","检验报告时间","检验科室名称","检验者姓名","检验样本","检验方法","检验值名称","检验值描述","检验值范围","样本编号","检验报告单位"
FROM 归档_化验报告@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复药库结转记录
delete from 负荷_药库结转 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_药库结转
SELECT "年月","机构编码","机构名称","药库名称","项目代码","国标代码","商品类型","商品名称","商品规格","生产厂家","供应商名称","包装单位","拆零单位","拆零比","库存单位","上期结存数","本期收入数","本期支出数","本期结存数","购入价","零售价","结转日期" 
FROM 归档_药库结转@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复药库消耗记录
delete from 负荷_药库消耗 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_药库消耗
SELECT "机构编码","机构名称","药库名称","项目代码","国标代码","商品类型","商品名称","商品规格","包装单位","拆零单位","拆零比","数量","单位","购入价","零售价","业务类型","业务日期","对方部门" 
FROM 归档_药库消耗@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复药房结转记录
delete from 负荷_药房结转 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_药房结转
SELECT "年月","机构编码","机构名称","药房名称","项目代码","国标代码","商品类型","商品名称","商品规格","生产厂家","供应商名称","包装单位","拆零单位","拆零比","库存单位","上期结存数","本期收入数","本期支出数","本期结存数","购入价","零售价","结转日期" 
FROM 归档_药房结转@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;

--*******************************************************************************************--
--脚本：恢复药房消耗记录
delete from 负荷_药房消耗 where 机构编码 = 'H00000000000';
commit;

insert into 负荷_药房消耗
SELECT "机构编码","机构名称","药房名称","项目代码","国标代码","商品类型","商品名称","商品规格","包装单位","拆零单位","拆零比","数量","单位","购入价","零售价","业务类型","业务日期","对方部门" 
FROM 归档_药房消耗@tar_link A where 档案编号 = 'JDZJ20240620' and 机构编码 = 'H00000000000';
commit;


