/*********************************************************************************************
脚本说明：以下脚本用于生成库房进销数据，运行时机构编码和机构数据表名称请注意替换成为实际机构
机构编码：H00000000000
机构名称：测试医院
**********************************************************************************************/

--*******************************************************************************************--
--脚本：从门诊、住院结算负荷表中归集药品、材料计费数据
create table 临时_物资计费 as 
select 机构编码,机构名称,业务周期,代码,国标,类别,名称,规格,
       COUNT(DISTINCT 就诊号) 计费人次,SUM(数量) 计费数量,SUM(金额) 计费金额,
       trunc(sum(数量*单价) / sum(数量),2) 计费均价,数量单位 计费单位
from(
SELECT 机构编码,机构名称,to_char(费用发生日期,'YYYY') as 业务周期,项目代码 代码,国标代码 国标,
DECODE(收费项目类别,'西药费','西药','成药费','成药','草药费','饮片','材料') 类别,
商品名 名称,规格,住院号 就诊号,数量,金额,单价,数量单位 FROM 负荷_住院结算
WHERE 机构编码 = 'H00000000000' and 收费项目类别 IN ('西药费','成药费','草药费','材料费')
union all
SELECT 机构编码,机构名称,to_char(费用发生日期,'YYYY') as 业务周期,项目代码 代码,国标代码 国标,
DECODE(收费项目类别,'西药费','西药','成药费','成药','草药费','饮片','材料') 类别,
商品名 名称,规格,门诊号 就诊号,数量,金额,单价,数量单位 FROM 负荷_门诊结算
WHERE 机构编码 = 'H00000000000' and 收费项目类别 IN ('西药费','成药费','草药费','材料费')
) a
GROUP BY 机构编码,机构名称,业务周期,代码,国标,类别,名称,规格,单价,数量单位
having sum(数量) > 0;

--脚本：从药库、药房消耗负荷表中归集药品、材料购入数据
create table 临时_物资购入 as 
select 机构编码,机构名称,代码,拆零比,
       sum(数量) as 购入数量,sum(数量*购入价) as 购入金额,trunc(sum(数量*购入价) / sum(数量),2) as 购入均价, 
       购入单位, 业务期间
from(
select 机构编码,机构名称,项目代码 as 代码,拆零比,
       数量,数量*购入价 as 购入金额,购入价, 包装单位 as 购入单位, to_char(业务日期,'YYYY') as 业务期间
from 负荷_药库消耗 where 机构编码 = 'H00000000000' and 业务类型 in ('物资采购') and 数量 > 0
union all
select 机构编码,机构名称,项目代码 as 代码,拆零比,
       数量,数量*购入价 as 购入金额,购入价, 包装单位 as 购入单位, to_char(业务日期,'YYYY') as 业务期间
from 负荷_药房消耗 where 机构编码 = 'H00000000000' and 业务类型 in ('物资采购') and 数量 > 0
) a
group by 机构编码,机构名称,代码,拆零比,购入单位,业务期间
having sum(数量) <> 0;

--脚本：从药库、药房消耗表中归集药品、材料退货数据
create table 临时_物资退货 as 
select 机构编码,机构名称,代码,拆零比,
       sum(数量) as 退货数量,sum(购入金额) as 退货金额,业务期间
from(
select 机构编码,机构名称,项目代码 as 代码,拆零比,
       数量,数量*购入价 as 购入金额, to_char(业务日期,'YYYY') as 业务期间
from 负荷_药库消耗 where 机构编码 = 'H00000000000' and 业务类型 in ('物资采购') and 数量 < 0
union all
select 机构编码,机构名称,项目代码 as 代码,拆零比,
       数量,数量*购入价 as 购入金额, to_char(业务日期,'YYYY') as 业务期间
from 负荷_药房消耗 where 机构编码 = 'H00000000000' and 业务类型 in ('物资采购') and 数量 < 0
) a
group by 机构编码,机构名称,业务期间,代码,拆零比;

--脚本：从药房消耗表中归集药品、材料门诊、住院销售数据
create table 临时_物资销售 as 
select 机构编码,机构名称,代码,单位 零售单位,
       sum(数量) as 零售数量,sum(数量*零售价) as 零售金额,trunc(sum(数量*零售价) / sum(数量),2) as 零售均价,业务期间
from(
select 机构编码,机构名称,项目代码 as 代码,单位,数量,零售价,to_char(业务日期,'YYYY') as 业务期间
from 负荷_药房消耗 where 机构编码 = 'H00000000000' and 业务类型 in ('门诊销售','住院销售')
) a
group by 机构编码,机构名称,代码,单位,业务期间;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：合并临时表中的购入和退货数据
begin
  for cur in (select a.rowid, b.退货数量,b.退货金额 from 临时_物资购入 a inner join 临时_物资退货 b 
    on a.机构编码 = b.机构编码 and a.业务期间 = b.业务期间 and a.代码 = b.代码 and a.拆零比 = b.拆零比) loop
    update 临时_物资购入 
    set 购入数量 = 购入数量 - cur.退货数量, 购入金额 = 购入金额 - cur.退货金额 where rowid = cur.rowid;
    end loop;
  commit;
end;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：将临时物资购入、销售数据归集至库房进销表
delete from 统计_库房进销 where 机构编码 = 'H00000000000';
commit;

INSERT INTO 统计_库房进销 (机构编码, 机构名称, 业务期间, 代码, 国标, 类别, 名称, 规格, 计费人次, 计费数量, 计费金额, 计费均价, 计费单位)
select 机构编码, 机构名称, 业务周期, 代码, 国标, 类别, 名称, 规格, 计费人次, 计费数量, 计费金额, 计费均价, 计费单位
from 临时_物资计费
ORDER BY 业务周期, 代码;
commit;

--脚本：更新库房进销数据的购入
begin
  for cur in (select a.rowid, b.购入数量,b.购入金额,b.购入均价,b.购入单位,b.拆零比
    from 统计_库房进销 a,临时_物资购入 b 
    where a.机构编码 = 'H00000000000' and a.机构编码 = b.机构编码 and a.业务期间 = b.业务期间 and a.代码 = b.代码) loop
    update 统计_库房进销 
    set 购入数量 = cur.购入数量,
    购入金额 = cur.购入金额,
    购入均价 = cur.购入均价,
    购入单位 = cur.购入单位,
    拆零比 = cur.拆零比 where rowid = cur.rowid;
    end loop;
  commit;
end;

--脚本：更新库房进销数据的销售
begin
  for cur in (select a.rowid, b.零售数量,b.零售金额,b.零售均价,b.零售单位 from 统计_库房进销 a,临时_物资销售 b 
    where a.机构编码 = 'H00000000000' and a.机构编码 = b.机构编码 and a.业务期间 = b.业务期间 and a.代码 = b.代码) loop
    update 统计_库房进销 
    set 销售数量 = cur.零售数量,
    销售金额 = cur.零售金额,
    销售均价 = cur.零售均价,
    销售单位 = cur.零售单位 where rowid = cur.rowid;
    end loop;
  commit;
end;
--*******************************************************************************************--

--脚本：删除临时表
drop table 临时_物资计费 purge;
drop table 临时_物资购入 purge;
drop table 临时_物资退货 purge;
drop table 临时_物资销售 purge;


