
delete from 字典_医嘱频次;
commit;

Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('st','即时','随时',1,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('prn','必要时','必要时',1,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('qd','每日一次','每天一次',1,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('qn','每晚一次','每晚一次',1,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('bid','每日两次','每天两次',1,2);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('tid','每日三次','每天三次',1,3);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('qid','每日四次','每天四次',1,4);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('quingid','每日五次','每天五次',1,5);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('qod','隔日一次','隔天一次',2,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q3d','三日一次','三天一次',3,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('qw','每周一次','一周一次',7,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('biw','每周两次','一周两次',7,2);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('tiw','每周三次','一周三次',7,3);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('qow','隔周一次','隔周一次',14,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('2W','每两周一次','两周一次',14,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('3W','每三周一次','三周一次',21,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('4W','每四周一次','四周一次',28,1);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q1/2h','每30分钟一次','半小时一次',1,48);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('qh','每小时一次','一小时一次',1,24);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q1h','每小时一次','一小时一次',1,24);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q2h','每二小时一次','二小时一次',1,12);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q3h','每三小时一次','三小时一次',1,8);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q4h','每四小时一次','四小时一次',1,6);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q5h','每五小时一次','五小时一次',1,5);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q6h','每六小时一次','六小时一次',1,4);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q8h','每八小时一次','八小时一次',1,3);
Insert into "字典_医嘱频次" ("英文名称","中文名称","中文别名","执行周期","执行频次") values ('q12h','每12小时一次','12小时一次',1,2);

commit;
