
delete from 规则_诊疗串换;
commit;


Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00120500001','大清创','(00120500003)','(小清创)','一般治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00120600001','特大换药','(00120600003)','(中换药)','一般治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00120600002','大换药|拆线（大）','(00120600004)','(小换药|拆线（小）)','一般治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00220301002','浅表器官彩色多普勒超声检查','(00220201007)','(浅表组织器官B超检查)','检查');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00220302012','临床操作的彩色多普勒超声引导','(00220201009)','(临床操作的B超引导)','检查');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00250501031','衣原体检查','(00250403051)','(沙眼衣原体肺炎血清学试验)','化验');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00250502010','肿瘤细胞化疗药物敏感试验','(00250402058)','(抗脱氧核糖核酸酶抗体检测)','化验');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00250700012','脱氧核糖核酸(DNA)倍体分析','(00250700017)','(白血病融合基因分型)','化验');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00270700001','原位杂交技术','(0025070001903)','(化学药物用药指导的基因检测)','化验');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00310402019','鼻负压置换治疗','(00310402012)','(鼻腔冲洗)','耳鼻喉');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00310402025','鼻部特殊治疗','(00310402025)','(鼻部电灼)','耳鼻喉');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00311400040','烧伤抢救(大)','(00311400042)','(烧伤抢救小)','一般治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00330100002','神经阻滞麻醉','(00330100001)','(局部浸润麻醉)','麻醉');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00331512017','骨移植术','(0033060802)','(异体骨人造骨填充)','骨科');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00331523006','石膏固定术(特大)','(00331523008)','(石膏固定术中)','骨科');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00331523007','石膏固定术(大)','(00331523009)','(石膏固定术小)','骨科');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00331602005','海绵状血管瘤切除术(大)','(00331602007)','(海绵状血管瘤切除术小)','普外');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00340100005','激光疗法','(00340100002)','(可见光治疗)','物理治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00340100016','空气负离子治疗','(00340100004)','(紫外线治疗)','物理治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00340100025','冷疗','(00121100001)','(一般物理降温)','物理治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00340200029','引导式教育训练','(00130900002)','(疾病健康教育)','康复治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00410000009','中药熏药治疗','(00410000006)','(中药熏洗治疗)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00430000020','磁热疗法','(00340100001)','(红外线治疗)','物理治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('00430000023','穴位贴敷治疗','(0041000000101)','(贴敷治疗)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('0025040200601','抗双链DNA测定(抗dsDNA)(免疫印迹法)','(00250402006)','(抗双链DNA测定抗dsDNA)','化验');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('0041000000103','贴敷疗法(大)','(0041000000100)','(贴敷疗法)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('0041000000104','贴敷疗法(特大)','(0041000000102)','(贴敷疗法中)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('0041000000203','中药化腐清创术(大)','(0041000000201)','(中药化腐清创术小)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('0041000000204','中药化腐清创术(特大)','(0041000000202)','(中药化腐清创术中)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('0041000000403','中药热奄包治疗(大)','(0041000000401)','(中药热奄包治疗小)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('0041000000404','中药热奄包治疗(特大)','(0041000000402)','(中药热奄包治疗中)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('0047000001303','烫熨治疗(大)','(0047000001301)','(烫熨治疗小)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('0047000001304','烫熨治疗(特大)','(0047000001302)','(烫熨治疗中)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('001208000020000','胃肠高营养治疗','(001208000010001)','(置管后注食)','一般治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('002403000090000','不规则野大面积照射','(002403000150000)','(适形调强放射治疗)','放射治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('003107020010000','有创性血流动力学','(003107010500000)','(持续中心静脉压力监测)','麻醉');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('003107020040000','射频消融术','(003315010580000)','(椎间盘微创消融术)','骨科');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('003109040060100','直肠肛门激光治疗','(003114000320000)','(激光照射治疗)','肛肠');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('003115030060000','穴位调控','(00430000023)','(穴位贴敷)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('003313060090000','经宫腔镜子宫内膜剥离术','(003313030010100)','(宫腔镜下子宫内膜息肉或赘生物切除术)','妇科');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('003315050230000','三踝骨折切开复位内固定术','(003315050220000)','(内外踝骨折切开复位内固定术)','骨科');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('003316020050100','体表血管瘤切除术','(003316020040000)','(浅表肿物切除术)','普外');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('004100000050003','中药封包治疗(大)','(004100000050001)','(中药封包治疗小)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('004100000050004','中药封包治疗(特大)','(004100000050002)','(中药封包治疗中)','中医治疗');

Insert into 规则_诊疗串换 (主项编码,主项名称,小项编码,小项名称,领域标识) 
values ('004200000090000','麻醉下腰椎间盘突出症大手法治疗','(004200000010000)','(骨折手法整复术)','骨科');

commit;
