
delete from 规则_诊疗加收;
commit;


Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003101000340000','交感神经节毁损术','003101000340001','交感神经节毁损术(胸交感神经酌情加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003103000020000','特殊视力检查','003103000020001','特殊视力检查(每增加一项加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003103000070000','验光','003103000070001','验光(每增加一项加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003103000200000','色觉检查','003103000200001','色觉检查(每增加一项加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003103000310000','青光眼视网膜神经纤维层计算机图象分析','003103000310001','青光眼视网膜神经纤维层计算机图象分析(增加定量分析加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003103000410000','角膜内皮镜检查','003103000410001','角膜内皮镜检查(录像记录加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003103000810000','激光治疗眼前节病','003103000810001','激光治疗眼前节病(多波长激光加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003103001060000','泪道探通术','003103001060001','泪道探通术(激光加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003104020010000','鼻内镜检查','003104020010001','鼻内镜检查(视频镜加收)',1,'耳鼻喉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003104030090000','纤维喉镜检查','003104030090001','纤维喉镜检查(电子镜加收)',1,'耳鼻喉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105000000000','口腔颌面','003105000000001','口腔颌面(疑难病症治疗加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105000000000','口腔颌面','003105000000003','口腔颌面(正畸专业治疗18岁以上成人加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105000000000','口腔颌面','003105000000002','口腔颌面(与医疗美容相关的治疗加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105010010000','全口牙病系统检查与治疗设计','003105010010001','全口牙病系统检查与治疗设计(牙周专业检查加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105050050000','唇弓制备','003105050050001','唇弓制备(特殊要求唇弓费用加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105050060000','合导板制备','003105050060001','合导板制备(特殊要求合导板费用加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105070020000','错合畸形治疗设计','003105070020001','错合畸形治疗设计(使用计算机进行三维牙合模型测量和X线头影测量酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105070060000','特殊矫治器复诊处置','003105070060001','特殊矫治器复诊处置(使用舌侧矫正器加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105090010000','种植治疗设计','003105090010001','种植治疗设计(CT颌骨重建模拟种植设计加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105100030000','牙脱敏治疗','003105100030001','牙脱敏治疗(使用激光脱敏仪加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105100080000','激光口内治疗','003105100080001','激光口内治疗(视病变范围增大酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110070000','树脂嵌体修复术','003105110070001','树脂嵌体修复术(高嵌体修复加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110090000','牙脱色术','003105110090001','牙脱色术(特殊仪器加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110100000','牙齿漂白术','003105110100001','牙齿漂白术(使用特殊仪器酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110160000','根管预备','003105110160001','根管预备(使用特殊仪器加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110170000','根管充填术','003105110170001','根管充填术(使用特殊仪器加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110180000','显微根管治疗术','003105110180001','显微根管治疗术(使用特殊仪器酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110190000','髓腔消毒术','003105110190001','髓腔消毒术(使用特殊仪器(微波仪等)酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110210000','根管再治疗术','003105110210001','根管再治疗术(使用显微镜、超声仪等特殊仪器加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110220000','髓腔穿孔修补术','003105110220001','髓腔穿孔修补术(使用特殊仪器加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105110230000','根管壁穿孔外科修补术','003105110230001','根管壁穿孔外科修补术(使用特殊仪器酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105130020000','龈下刮治','003105130020001','龈下刮治(后压龈下刮治加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105130080000','根面平整术','003105130080001','根面平整术(超声根面平整加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105160040000','关节镜手术治疗','003105160040001','关节镜手术治疗(关节下腔治疗加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105190010000','拆冠桥','003105190010001','拆冠桥(铸造冠拆除加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105190030000','加焊','003105190030002','加焊(＞2mm加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105190030000','加焊','003105190030001','加焊(激光焊接加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105210010000','腭护板导板矫治','003105210010001','腭护板导板矫治(加放射治疗装置加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105210010000','腭护板导板矫治','003105210010002','腭护板导板矫治(间接法制作加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105210020000','义颌修复','003105210020001','义颌修复(上或下颌骨一侧全切加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105210020000','义颌修复','003105210020002','义颌修复(分段或分区双重印模双收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105210030000','软腭抬高器治疗','003105210030001','软腭抬高器治疗(咽阻塞器加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220010000','乳牙期安氏I类错合正畸治疗','003105220010001','乳牙期安氏I类错合正畸治疗(前牙或后牙开合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220040000','恒牙期安氏I类错合固定矫治器正畸治疗','003105220040003','恒牙期安氏I类错合固定矫治器正畸治疗(拔牙病例加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220040000','恒牙期安氏I类错合固定矫治器正畸治疗','003105220040001','恒牙期安氏I类错合固定矫治器正畸治疗(伴开合、深覆合等疑难病例加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220040000','恒牙期安氏I类错合固定矫治器正畸治疗','003105220040002','恒牙期安氏I类错合固定矫治器正畸治疗(阻生齿开窗矫治病例加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220070000','替牙期牙性安氏II类错合活动矫治器正畸治疗','003105220070003','替牙期牙性安氏II类错合活动矫治器正畸治疗(严重深覆合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220070000','替牙期牙性安氏II类错合活动矫治器正畸治疗','003105220070002','替牙期牙性安氏II类错合活动矫治器正畸治疗(前牙或后牙开合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220070000','替牙期牙性安氏II类错合活动矫治器正畸治疗','003105220070001','替牙期牙性安氏II类错合活动矫治器正畸治疗(前牙反合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220080000','替牙期牙性安氏II类错合固定矫治器正畸治疗','003105220080001','替牙期牙性安氏II类错合固定矫治器正畸治疗(前牙反合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220080000','替牙期牙性安氏II类错合固定矫治器正畸治疗','003105220080002','替牙期牙性安氏II类错合固定矫治器正畸治疗(前牙或后牙开合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220080000','替牙期牙性安氏II类错合固定矫治器正畸治疗','003105220080003','替牙期牙性安氏II类错合固定矫治器正畸治疗(严重深覆合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220090000','替牙期骨性安氏II类错合正畸治疗','003105220090002','替牙期骨性安氏II类错合正畸治疗(前牙或后牙开合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220090000','替牙期骨性安氏II类错合正畸治疗','003105220090001','替牙期骨性安氏II类错合正畸治疗(前牙反合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220090000','替牙期骨性安氏II类错合正畸治疗','003105220090003','替牙期骨性安氏II类错合正畸治疗(严重深覆合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220100000','恒牙早期安氏II类错合功能矫治器治疗','003105220100001','恒牙早期安氏II类错合功能矫治器治疗(前牙或后牙开合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220100000','恒牙早期安氏II类错合功能矫治器治疗','003105220100002','恒牙早期安氏II类错合功能矫治器治疗(严重深覆合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220110000','恒牙期牙性安氏II类错合固定矫治器治疗','003105220110001','恒牙期牙性安氏II类错合固定矫治器治疗(伴前牙严重开合、深覆合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220110000','恒牙期牙性安氏II类错合固定矫治器治疗','003105220110002','恒牙期牙性安氏II类错合固定矫治器治疗(阻生齿开窗矫治、磨牙拔除矫治加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220120000','恒牙期骨性安氏II类错合固定矫治器拔牙治疗','003105220120001','恒牙期骨性安氏II类错合固定矫治器拔牙治疗(伴前牙严重开合、深覆合等复杂疑难病例加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220120000','恒牙期骨性安氏II类错合固定矫治器拔牙治疗','003105220120002','恒牙期骨性安氏II类错合固定矫治器拔牙治疗(阻生齿开窗矫治、磨牙拔除矫治加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220140000','替牙期安氏III类错合正畸治疗','003105220140001','替牙期安氏III类错合正畸治疗(全牙弓反合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220150000','替牙期安氏III类错合功能矫治器治疗','003105220150001','替牙期安氏III类错合功能矫治器治疗(伴开合、深覆合等疑难病加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220160000','恒牙期安氏III类错合固定矫治器治疗','003105220160001','恒牙期安氏III类错合固定矫治器治疗(全牙弓反合加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220160000','恒牙期安氏III类错合固定矫治器治疗','003105220160002','恒牙期安氏III类错合固定矫治器治疗(伴开合、深覆合等复杂疑难病加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220160000','恒牙期安氏III类错合固定矫治器治疗','003105220160003','恒牙期安氏III类错合固定矫治器治疗(磨牙拔除矫治加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220170000','恒牙期骨性安氏III类错合固定矫治器拔牙治疗','003105220170001','恒牙期骨性安氏III类错合固定矫治器拔牙治疗(隐形材料加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220180000','牙周病伴错合畸形活动矫治器正畸治疗','003105220180001','牙周病伴错合畸形活动矫治器正畸治疗(重度牙周炎的正畸治疗加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220190000','牙周病伴错合畸形固定矫治器正畸治疗','003105220190001','牙周病伴错合畸形固定矫治器正畸治疗(伴开合、深覆合等疑难病加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003105220190000','牙周病伴错合畸形固定矫治器正畸治疗','003105220190002','牙周病伴错合畸形固定矫治器正畸治疗(拔牙矫治加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003106050000000','呼吸系统窥镜诊疗','003106050000001','呼吸系统窥镜诊疗(使用电子纤维内镜酌情加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003107010010000','常规心电图检查','003107010010002','常规心电图检查(十二通道加收)',1,'心电');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003107010010000','常规心电图检查','003107010010001','常规心电图检查(附加导联加收)',1,'心电');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003107010010000','常规心电图检查','003107010010003','常规心电图检查(床旁心电图加收)',1,'心电');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003107010010000','常规心电图检查','003107010010005','常规心电图检查(十八通道加收)',1,'心电');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003107010010000','常规心电图检查','003107010010004','常规心电图检查(三通道加收)',1,'心电');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003107010140000','心阻抗图','003107010140001','心阻抗图(心导纳图酌情加收)',1,'心电');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003107010180000','心率变异性分析','003107010180001','心率变异性分析(24小时加收)',1,'心电');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003107020200000','右心导管检查术','003107020200001','右心导管检查术(血氧测定加收)',1,'介入治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003108000050000','血细胞分离单采','003108000050001','血细胞分离单采(每增加循环量1000ml加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109010040000','纤维食管镜检查','003109010040001','纤维食管镜检查(电子镜加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109010050000','经食管镜取异物','003109010050001','经食管镜取异物(电子镜加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109020010000','胃肠电图','003109020010001','胃肠电图(动态胃电图加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109020010000','胃肠电图','003109020010002','胃肠电图(导纳式胃动力检测加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109020050000','纤维胃十二指肠镜检查','003109020050001','纤维胃十二指肠镜检查(电子镜加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109020080000','经胃镜碎石术','003109020080001','经胃镜碎石术(电子镜加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109030050000','纤维结肠镜检查','003109030050001','纤维结肠镜检查(电子镜加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109030060000','乙状结肠镜检查','003109030060001','乙状结肠镜检查(电子镜加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109050020000','腹水直接回输治疗','003109050020001','腹水直接回输治疗(超滤回输加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109050060000','胆道镜检查','003109050060001','胆道镜检查(超选择造影加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109050200000','经内镜胰胆管扩张术＋支架置入术','003109050200001','经内镜胰胆管扩张术＋支架置入术(双管加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003109050240000','经内镜胆管内超声检查术','003109050240001','经内镜胆管内超声检查术(治疗酌情加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003110000110000','连续性血液净化','003110000110001','连续性血液净化(机器法加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003112010040000','阴道镜检查','003112010040001','阴道镜检查(电子镜加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003112010410000','胚胎移植术','003112010410001','胚胎移植术(冻融胚胎各加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003112010480000','宫内节育器放置术','003112010480001','宫内节育器放置术(双子宫上环加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003112020090000','新生儿兰光治疗','003112020090001','新生儿兰光治疗(冷光源兰光酌情加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003115010010000','精神科A类量表测查','003115010010001','精神科A类量表测查(使用电脑自测的量表酌情加收)',1,'精神治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003115010020000','精神科B类量表测查','003115010020001','精神科B类量表测查(使用电脑自测的量表酌情加收)',1,'精神治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003115010030000','精神科C类量表测查','003115010030001','精神科C类量表测查(使用电脑自测的量表酌情加收)',1,'精神治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003205000010000','冠状动脉造影术','003205000010001','冠状动脉造影术(同时做左心室造影加收)',1,'介入治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003205000020000','经皮冠状动脉腔内成形术(PTCA)','003205000020001','经皮冠状动脉腔内成形术(PTCA)(扩张多支血管每支加收)',1,'介入治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003205000030000','经皮冠状动脉内支架置入术(STENT)','003205000030001','经皮冠状动脉内支架置入术(STENT)(扩张多支血管加收)',1,'介入治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003205000040000','经皮冠状动脉腔内激光成形术(ELCA)','003205000040001','经皮冠状动脉腔内激光成形术(ELCA)(多支血管加收)',1,'介入治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003205000050000','高速冠状动脉内膜旋磨术','003205000050001','高速冠状动脉内膜旋磨术(旋磨多支血管每支加收)',1,'介入治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003205000060000','定向冠脉内膜旋切术','003205000060001','定向冠脉内膜旋切术(多支血管加收)',1,'介入治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003301000000000','麻醉','003301000000001','麻醉(危急病人酌情加收)',1,'麻醉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003301000020000','神经阻滞麻醉','003301000020001','神经阻滞麻醉(每增加1小时酌情加收)',1,'麻醉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003301000030000','椎管内麻醉','003301000030002','椎管内麻醉(每增加1小时酌情加收)',1,'麻醉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003301000030000','椎管内麻醉','003301000030001','椎管内麻醉(双穿刺点加收)',1,'麻醉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003301000030000','椎管内麻醉','003301000030003','椎管内麻醉(腰麻硬膜外联合阻滞酌情加收)',1,'麻醉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003301000050000','全身麻醉','003301000050001','全身麻醉(每增加1小时酌情加收)',1,'麻醉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003301000070000','支气管内麻醉','003301000070001','支气管内麻醉(每增加1小时酌情加收)',1,'麻醉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003301000080000','术后镇痛','003301000080001','术后镇痛(腰麻硬膜外联合阻滞酌情加收)',1,'麻醉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003301000170000','体外循环','003301000170001','体外循环(每增加1小时酌情加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302000000000','神经系统手术','003302000000001','神经系统手术(神经系统手术中应用神经导航系统酌情加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302010010000','头皮肿物切除术','003302010010001','头皮肿物切除术(直径大于4cm酌情加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302010060000','开放性颅脑损伤清除术','003302010060001','开放性颅脑损伤清除术(静脉窦破裂手术酌情加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302010100000','颅骨钻孔探查术','003302010100001','颅骨钻孔探查术(两孔以上酌情加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302010140000','颅内多发血肿清除术','003302010140001','颅内多发血肿清除术(非同一部位血肿酌情加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302010150000','颅内血肿清除术','003302010150001','颅内血肿清除术(经颅内镜加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302010600000','立体定向脑深部核团毁损术','003302010600001','立体定向脑深部核团毁损术(两个以上靶点酌情加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302020070000','颅神经微血管减压术','003302020070001','颅神经微血管减压术(经颅内镜加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302030010000','颅内巨大动脉瘤夹闭切除术','003302030010001','颅内巨大动脉瘤夹闭切除术(多夹除一个动脉瘤加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302030020000','颅内动脉瘤夹闭术','003302030020001','颅内动脉瘤夹闭术(多夹除一个动脉瘤加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302030060000','脑动脉瘤动静脉畸形切除术','003302030060001','脑动脉瘤动静脉畸形切除术(动脉瘤与动静脉畸形不在同一部位加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302030070000','颈内动脉内膜剥脱术','003302030070001','颈内动脉内膜剥脱术(行动脉成形术加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302030080000','椎动脉内膜剥脱术','003302030080001','椎动脉内膜剥脱术(行动脉成形术加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302030110000','颈总动脉大脑中动脉吻合术','003302030110001','颈总动脉大脑中动脉吻合术(取大隐静脉加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302040070000','脊髓内病变切除术','003302040070001','脊髓内病变切除术(肿瘤长度超过5cm加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003302040090000','髓外硬脊膜下病变切除术','003302040090001','髓外硬脊膜下病变切除术(肿瘤长度超过5cm酌情加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003303000180000','胸腺切除术','003303000180001','胸腺切除术(经胸腔镜加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003303000210000','肾上腺切除术','003303000210002','肾上腺切除术(经腹腔镜加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003303000210000','肾上腺切除术','003303000210001','肾上腺切除术(显微手术加收)',1,'神经');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304010010000','眼睑肿物切除术','003304010010001','眼睑肿物切除术(需植皮时加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304010040000','上睑下垂矫正术','003304010040001','上睑下垂矫正术(需肌瓣移植时加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304010060000','睑退缩矫正术','003304010060001','睑退缩矫正术(睫毛再造加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304010060000','睑退缩矫正术','003304010060002','睑退缩矫正术(肌瓣移植加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304010080000','睑外翻矫正术','003304010080001','睑外翻矫正术(需植皮时加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304010150000','眼袋整形术','003304010150001','眼袋整形术(泪腺悬吊加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304020070000','鼻腔泪囊吻合术','003304020070001','鼻腔泪囊吻合术(经鼻内镜加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304030020000','结膜肿物切除术','003304030020001','结膜肿物切除术(组织移植加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304040080000','翼状胬肉切除＋角膜移植术','003304040080001','翼状胬肉切除＋角膜移植术(干细胞移植加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304040080000','角膜移植术','003304040080001','翼状胬肉切除＋角膜移植术(干细胞移植加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304080010000','共同性斜视矫正术','003304080010001','共同性斜视矫正术(超过一条肌肉及二次手术或伴有另一种斜视同时手术酌情加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304080010000','共同性斜视矫正术','003304080010002','共同性斜视矫正术(多次手术再加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304080020000','非共同性斜视矫正术','003304080020001','非共同性斜视矫正术(超过一条肌肉及二次手术、结膜、肌肉及眼眶修复，二种斜视同时存在，非常规眼外肌手术酌情计价)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304080020000','非共同性斜视矫正术','003304080020002','非共同性斜视矫正术(多次手术再加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304080030000','非常规眼外肌手术','003304080030001','非常规眼外肌手术(每增加一个手术加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304090140000','眶内肿物摘除术','003304090140001','眶内肿物摘除术(侧劈开眶加收)',1,'眼科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003304090280000','眉缺损修复术','003304090280001','眉缺损修复术(岛状头皮瓣切取移转术时酌情加收)',1,'耳鼻喉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003305030050000','翼管神经切断术','003305030050001','翼管神经切断术(经鼻内镜加收)',1,'耳鼻喉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306010010000','鼻外伤清创缝合术','003306010010001','鼻外伤清创缝合术(复杂病变酌情加收)',1,'耳鼻喉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306040290000','牙龈翻瓣术','003306040290001','牙龈翻瓣术(根向复位切口加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306040290000','牙龈翻瓣术','003306040290002','牙龈翻瓣术(冠向复位切口加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306040290000','牙龈翻瓣术','003306040290003','牙龈翻瓣术(远中楔形切除加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306050280000','腮腺全切除术','003306050280001','腮腺全切除术(升支截断复位固定酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306050330000','颌面颈部深部肿物探查术','003306050330001','颌面颈部深部肿物探查术(切除术酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306060080000','悬雍垂腭咽成形术(UPPP)','003306060080001','悬雍垂腭咽成形术(UPPP)(激光加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306060110000','单侧不完全唇裂修复术','003306060110001','单侧不完全唇裂修复术(双侧加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306060120000','单侧完全唇裂修复术','003306060120001','单侧完全唇裂修复术(双侧加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306060160000','III°腭裂兰氏修复术','003306060160001','III°腭裂兰氏修复术(每加一侧酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306060170000','反向双Z腭裂修复术','003306060170001','反向双Z腭裂修复术(每加一侧酌情加收))',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306060180000','单瓣二瓣后退腭裂修复术','003306060180001','单瓣二瓣后退腭裂修复术(每加一侧酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306060190000','腭咽环扎腭裂修复术','003306060190001','腭咽环扎腭裂修复术(每加一侧酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306060200000','组织瓣转移腭裂修复术','003306060200001','组织瓣转移腭裂修复术(每加一侧加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306070010000','上颌雷弗特I型截骨术(LeFort)','003306070010001','上颌雷弗特I型截骨术(上颌雷弗特(LeFort)分块截骨术加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306070130000','颌骨延长骨生成术','003306070130001','颌骨延长骨生成术(骨延长器置入后的加力酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003306080130000','颧骨上颌骨复合骨折切开复位内固定术','003306080130001','颧骨上颌骨复合骨折切开复位内固定术(双侧颧骨或颧弓骨折酌情加收)',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307010010000','经直达喉镜喉肿物摘除术','003307010010001','经直达喉镜喉肿物摘除术(纤维喉镜加收)',1,'耳鼻喉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307010220000','喉良性肿瘤切除术','003307010220001','喉良性肿瘤切除术(经支撑喉镜加收)',1,'耳鼻喉');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307010410000','气管内肿瘤切除术','003307010410001','气管内肿瘤切除术(经内镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307010410000','气管内肿瘤切除术','003307010410002','气管内肿瘤切除术(激光加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020000000','肺和支气管手术','003307020000001','肺和支气管手术(双侧手术加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020010000','肺内异物摘除术','003307020010001','肺内异物摘除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020020000','肺癌根治术','003307020020001','肺癌根治术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020030000','肺段切除术','003307020030001','肺段切除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020040000','肺减容手术','003307020040001','肺减容手术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020050000','肺楔形切除术','003307020050001','肺楔形切除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020060000','肺叶切除术','003307020060001','肺叶切除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020080000','全肺切除术','003307020080002','全肺切除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020080000','全肺切除术','003307020080001','全肺切除术(经心包内全肺切除及部分心房切除酌情加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020090000','肺大泡切除修补术','003307020090001','肺大泡切除修补术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020110000','肺修补术','003307020110100','肺修补术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307020150000','肺包虫病内囊摘除术','003307020150001','肺包虫病内囊摘除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030030000','开胸探查术','003307030030001','开胸探查术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030040000','开胸止血术','003307030040001','开胸止血术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030160000','胸内异物清除术','003307030160001','胸内异物清除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030180000','脓胸大网膜填充术','003307030180001','脓胸大网膜填充术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030190000','胸膜剥脱术','003307030190001','胸膜剥脱术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030200000','脓胸引流清除术','003307030200001','脓胸引流清除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030210000','胸膜活检术','003307030210001','胸膜活检术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030220000','胸膜粘连烙断术','003307030220001','胸膜粘连烙断术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030230000','胸膜固定术','003307030230001','胸膜固定术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030260000','纵隔肿物切除术','003307030260001','纵隔肿物切除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030280000','膈肌修补术','003307030280001','膈肌修补术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030320000','先天性膈疝修补术','003307030320001','先天性膈疝修补术(嵌顿或巨大疝加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030330000','先天性食管裂孔疝修补术','003307030330001','先天性食管裂孔疝修补术(合并肠回转不良及其他须矫治畸形加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030330000','先天性食管裂孔疝修补术','003307030330001','先天性食管裂孔疝修补术(合并肠回转不良及其他须矫治畸形加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030340000','食管裂孔疝修补术','003307030340001','食管裂孔疝修补术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003307030340000','食管裂孔疝修补术','003307030340002','食管裂孔疝修补术(经腹腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308020070000','小切口冠状动脉搭桥术','003308020070001','小切口冠状动脉搭桥术(经胸腔镜取乳内动脉加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308020140000','动脉导管闭合术','003308020140001','动脉导管闭合术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308030040000','心包肿瘤切除术','003308030040001','心包肿瘤切除术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308030050000','心包开窗引流术','003308030050001','心包开窗引流术(经胸腔镜加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308030090000','心脏良性肿瘤摘除术','003308030090001','心脏良性肿瘤摘除术(多发肿瘤加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308040160000','腹主动脉双股动脉Y型人工血管转流术','003308040160001','腹主动脉双股动脉Y型人工血管转流术(继续向远端架桥的，每增加一根血管加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308040170000','腹主动脉股动脉人工血管转流术','003308040170001','腹主动脉股动脉人工血管转流术(向远端架桥，每增加一根血管加收)',1,'心胸');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308040430000','肢体动静脉切开取栓术','003308040430001','肢体动静脉切开取栓术(双侧或多部位取栓，每增加一切口加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308040480000','腋双股动脉人工血管转流术','003308040480001','腋双股动脉人工血管转流术(继续向远端动脉架桥，每增一支加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308040490000','腋股动脉人工血管转流术','003308040490001','腋股动脉人工血管转流术(继续向远端动脉架桥，每增一支加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308040570000','外伤性动静脉瘘修补术＋血管移植术','003308040570001','外伤性动静脉瘘修补术＋血管移植术(一根血管加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308040620000','大隐静脉高位结扎＋剥脱术','003308040620001','大隐静脉高位结扎＋剥脱术(经腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003308040760000','静脉血管平滑肌肉瘤切除术','003308040760001','静脉血管平滑肌肉瘤切除术(人工血管重建术加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003309000090000','胸导管结扎术','003309000090001','胸导管结扎术(经胸腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003309000160000','脾部分切除术','003309000160100','脾部分切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003309000170000','脾修补术','003309000170100','脾修补术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003309000180000','脾切除术','003309000180001','脾切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310010020000','食管破裂修补术','003310010020300','食管破裂修补术(经胸腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310010040000','食管良性肿物切除术','003310010040001','食管良性肿物切除术(经胸腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310010050000','先天性食管囊肿切除术','003310010050001','先天性食管囊肿切除术(经胸腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310010060000','食管憩室切除术','003310010060001','食管憩室切除术(经胸腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310010110000','食管癌根治术','003310010110001','食管癌根治术(三切口联合加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310010140000','食管癌根治+结肠代食管术','003310010140100','食管癌根治+结肠代食管术(经胸腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310010210000','贲门痉挛(失弛缓症)肌层切开术','003310010210100','贲门痉挛(失弛缓症)肌层切开术(经胸腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020010000','胃肠切开取异物','003310020010001','胃肠切开取异物(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020020000','胃出血切开缝扎止血术','003310020020001','胃出血切开缝扎止血术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020030000','近端胃大部切除术','003310020030001','近端胃大部切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020040100','远端胃大部切除术','003310020040001','远端胃大部切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020040200','远端胃大部切除术','003310020040001','远端胃大部切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020040300','远端胃大部切除术','003310020040001','远端胃大部切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020050000','胃癌根治术','003310020050001','胃癌根治术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020090000','胃肠造瘘术','003310020090001','胃肠造瘘术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020100000','胃扭转复位术','003310020100001','胃扭转复位术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020110000','胃肠穿孔修补术','003310020110001','胃肠穿孔修补术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020130000','胃迷走神经切断术','003310020130001','胃迷走神经切断术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310020140000','幽门成形术','003310020140001','幽门成形术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310030060000','肠扭转肠套叠复位术','003310030060001','肠扭转肠套叠复位术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310030070000','肠切除术','003310030070001','肠切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310030080000','肠粘连松解术','003310030080001','肠粘连松解术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310030130000','肠排列术(固定术)','003310030130001','肠排列术(固定术)(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310030150000','乙状结肠悬吊术','003310030150001','乙状结肠悬吊术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310030170000','结肠造瘘(Colostomy)术','003310030170001','结肠造瘘(Colostomy)术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310030190000','先天性巨结肠切除术','003310030190001','先天性巨结肠切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310030200000','结肠癌根治术','003310030200001','结肠癌根治术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310030220000','阑尾切除术','003310030220001','阑尾切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310040120000','经腹直肠癌根治术(Dixon手术)','003310040120001','经腹直肠癌根治术(Dixon手术)(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310040130000','直肠癌扩大根治术','003310040130001','直肠癌扩大根治术(全盆腔脏器切除加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310050010000','肝损伤清创修补术','003310050010001','肝损伤清创修补术(伤及大血管、胆管和多破口的修补加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310050010000','肝损伤清创修补术','003310050010002','肝损伤清创修补术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310050010000','肝损伤清创修补术','003310050010002','肝损伤清创修补术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310050010000','肝损伤清创修补术','003310050010001','肝损伤清创修补术(伤及大血管、胆管和多破口的修补加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310050130000','肝部分切除术','003310050130001','肝部分切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310060010000','胆囊肠吻合术','003310060010001','胆囊肠吻合术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310060020000','胆囊切除术','003310060020001','胆囊切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310060030000','胆囊造瘘术','003310060030001','胆囊造瘘术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310060110000','胆总管探查T管引流术','003310060110001','胆总管探查T管引流术(术中取石、冲洗加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310060110000','胆总管探查T管引流术','003310060110002','胆总管探查T管引流术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310070040000','胰腺囊肿外引流术','003310070040001','胰腺囊肿外引流术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310070070000','胰体尾切除术','003310070070001','胰体尾切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310080010000','腹股沟疝修补术','003310080010001','腹股沟疝修补术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310080100000','腹腔包虫摘除术','003310080100001','腹腔包虫摘除术(多发包虫加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310080120000','腹腔内肿物切除术','003310080120001','腹腔内肿物切除术(经腹腔镜加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310080170000','腹壁肿瘤切除术','003310080170001','腹壁肿瘤切除术(超过5cm直径加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003310080260000','门体静脉断流术','003310080260001','门体静脉断流术(食管横断吻合术加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311010080000','肾切除术','003311010080001','肾切除术(经腹腔镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311010140000','肾囊肿切除术','003311010140001','肾囊肿切除术(经腹腔镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311010250000','肾肿瘤腔静脉内瘤栓切取术','003311010250001','肾肿瘤腔静脉内瘤栓切取术(开胸手术加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311020010000','肾盂癌根治术','003311020010001','肾盂癌根治术(经腹腔镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311020050000','肾盂输尿管成形术','003311020050001','肾盂输尿管成形术(同时行双侧成形术加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311020050000','肾盂输尿管成形术','003311020050002','肾盂输尿管成形术(经腹腔镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311020070000','输尿管切开取石术','003311020070001','输尿管切开取石术(经腹腔镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311020100000','输尿管开口囊肿切除术','003311020100001','输尿管开口囊肿切除术(经膀胱镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311030160000','膀胱破裂修补术','003311030160001','膀胱破裂修补术(经腹腔镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311030220000','膀胱颈悬吊术','003311030220001','膀胱颈悬吊术(经腹腔镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311040110000','尿道癌根治术','003311040110001','尿道癌根治术(需膀胱全切时酌情加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311040110000','尿道癌根治术','003311040110002','尿道癌根治术(尿路重建时酌情加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003311040280000','尿道上裂膀胱外翻矫治术','003311040280001','尿道上裂膀胱外翻矫治术(需骨盆截骨时酌情加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003312010020000','耻骨上前列腺切除术','003312010020001','耻骨上前列腺切除术(经腹腔镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003312030060000','精索静脉曲张高位结扎术','003312030060001','精索静脉曲张高位结扎术(分流术加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003312030060000','精索静脉曲张高位结扎术','003312030060002','精索静脉曲张高位结扎术(经腹腔镜加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003312040150000','阴茎阴囊移位整形术','003312040150001','阴茎阴囊移位整形术(增加会阴型尿道下裂修补时酌情加收)',1,'泌尿');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313010020000','卵巢囊肿剔除术','003313010020001','卵巢囊肿剔除术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313010030000','卵巢修补术','003313010030001','卵巢修补术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313010060000','卵巢癌根治术','003313010060001','卵巢癌根治术(如膀胱或肠管部分切除加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313010080000','卵巢输卵管切除术','003313010080001','卵巢输卵管切除术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313010080000','卵巢输卵管切除术','003313010080001','卵巢输卵管切除术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313020010000','输卵管结扎术','003313020010001','输卵管结扎术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313020030000','输卵管修复整形术','003313020030001','输卵管修复整形术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030010000','宫颈息肉切除术','003313030010001','宫颈息肉切除术(经宫腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030040000','宫颈锥形切除术','003313030040001','宫颈锥形切除术(经宫腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030050000','宫颈环形电切术','003313030050001','宫颈环形电切术(使用Leep刀加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030110000','经腹子宫肌瘤剔除术','003313030110002','经腹子宫肌瘤剔除术(使用肌瘤粉碎装置加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030110000','经腹子宫肌瘤剔除术','003313030110001','经腹子宫肌瘤剔除术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030140000','腹式全子宫切除术','003313030140001','腹式全子宫切除术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030180000','经腹阴道联合子宫切除术','003313030180001','经腹阴道联合子宫切除术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030190000','子宫整形术','003313030190002','子宫整形术(使用腹腔镜辅助手术时酌情加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030190000','子宫整形术','003313030190001','子宫整形术(使用宫腔镜辅助手术时酌情加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313030220000','子宫动脉结扎术','003313030220001','子宫动脉结扎术(经腹腔镜加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313060050000','经宫腔镜输卵管插管术','003313060050001','经宫腔镜输卵管插管术(腹腔镜辅助手术酌情加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313060060000','经宫腔镜盆腔粘连分离术','003313060060001','经宫腔镜盆腔粘连分离术(腹腔镜辅助手术酌情加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313060070000','经宫腔镜子宫纵隔切除术','003313060070001','经宫腔镜子宫纵隔切除术(腹腔镜辅助手术酌情加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313060080000','经宫腔镜子宫肌瘤切除术','003313060080001','经宫腔镜子宫肌瘤切除术(腹腔镜辅助手术酌情加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003313060090000','经宫腔镜子宫内膜剥离术','003313060090001','经宫腔镜子宫内膜剥离术(腹腔镜辅助手术酌情加收)',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010260000','后入路枢环枕融合植骨固定术','003315010260001','后入路枢环枕融合植骨固定术(增加枕骨大孔扩大及环枕后弓减压时加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010260000','后入路枢环枕融合植骨固定术','003315010290001','后入路枢环枕融合植骨固定术(椎体后缘减压术加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010320000','胸腰椎骨折切开复位内固定术','003315010320001','胸腰椎骨折切开复位内固定术(如需从前侧方入路脊髓前外侧减压手术酌情加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010360000','椎管扩大减压术','003315010360001','椎管扩大减压术(增加神经根管减压加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010420000','腰椎滑脱椎弓根螺钉固定植骨融合术','003315010420001','腰椎滑脱椎弓根螺钉固定植骨融合术(行椎板切除减压间盘摘除酌情加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010470000','强直性脊柱炎多椎截骨矫正术','003315010470001','强直性脊柱炎多椎截骨矫正术(前方入路松解手术加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010470000','强直性脊柱炎多椎截骨矫正术','003315010470002','强直性脊柱炎多椎截骨矫正术(增加内固定加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010480000','脊柱侧弯矫正术(后路)','003315010480001','脊柱侧弯矫正术(后路)(前方入路松解手术加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010480000','脊柱侧弯矫正术(后路)','003315010480002','脊柱侧弯矫正术(后路)(植骨融合加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010490000','前路脊柱松解融合术','003315010490001','前路脊柱松解融合术(前方入路松解手术加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010490000','前路脊柱松解融合术','003315010490002','前路脊柱松解融合术(植骨融合加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010500000','前路脊柱旋转侧弯矫正术','003315010500001','前路脊柱旋转侧弯矫正术(前方入路松解手术加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010500000','前路脊柱旋转侧弯矫正术','003315010500002','前路脊柱旋转侧弯矫正术(植骨融合加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010510000','前路脊柱骨骺阻滞术后路椎板凸侧融合术','003315010510001','前路脊柱骨骺阻滞术后路椎板凸侧融合术(开胸加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010510000','前路脊柱骨骺阻滞术后路椎板凸侧融合术','003315010510002','前路脊柱骨骺阻滞术后路椎板凸侧融合术(植骨加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010550000','滑板椎弓根钉复位植骨内固定术','003315010550001','滑板椎弓根钉复位植骨内固定术(松解手术加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010550000','滑板椎弓根钉复位植骨内固定术','003315010550002','滑板椎弓根钉复位植骨内固定术(椎板切除减压加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010580000','椎间盘微创消融术','003315010580001','椎间盘微创消融术(每增加一间盘酌情加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010590000','经皮椎体成形术','003315010590001','经皮椎体成形术(每增加一椎体酌情加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315010600000','人工椎体置换术','003315010600001','人工椎体置换术(每增加一椎体酌情加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315020010000','胸出口综合征手术','003315020010001','胸出口综合征手术(联合手术加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315020040000','臂丛神经损伤神经移位术','003315020040001','臂丛神经损伤神经移位术(联合手术加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315030030000','肱骨肿瘤切除及骨重建术','003315030030001','肱骨肿瘤切除及骨重建术(瘤体有周围组织浸润加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315030040000','尺桡骨肿瘤切除及骨重建术','003315030040001','尺桡骨肿瘤切除及骨重建术(瘤体有周围组织浸润加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315050380000','足部骨骨折切开复位内固定术','003315050380001','足部骨骨折切开复位内固定术(双侧多次骨折酌情加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060020000','肩关节脱位切开复位术','003315060020001','肩关节脱位切开复位术(陈旧脱位加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060110000','急性膝关节前后十字韧带破裂修补术','003315060110001','急性膝关节前后十字韧带破裂修补术(经膝关节镜加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060120000','膝关节陈旧性前十字韧带重建术','003315060120001','膝关节陈旧性前十字韧带重建术(经膝关节镜加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060130000','膝关节陈旧性后十字韧带重建术','003315060130001','膝关节陈旧性后十字韧带重建术(经膝关节镜加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060150000','膝关节单纯游离体摘除术','003315060150001','膝关节单纯游离体摘除术(经膝关节镜加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060160000','关节滑膜切除术(大)','003315060160001','关节滑膜切除术(大)(经关节镜加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060160000','关节滑膜切除术(大)','003315060160002','关节滑膜切除术(大)(激光加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060170000','关节滑膜切除术(中)','003315060170002','关节滑膜切除术(中)(激光加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060170000','关节滑膜切除术(中)','003315060170001','关节滑膜切除术(中)(经关节镜加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060180000','关节滑膜切除术(小)','003315060180002','关节滑膜切除术(小)(激光加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060180000','关节滑膜切除术(小)','003315060180001','关节滑膜切除术(小)(经关节镜加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060190000','半月板切除术','003315060190002','半月板切除术(激光加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060190000','半月板切除术','003315060190001','半月板切除术(经关节镜加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315060220000','_窝囊肿切除术','003315060220001','_窝囊肿切除术(双侧加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315070010000','人工全肩关节置换术','003315070010001','人工全肩关节置换术(再置换加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315070030000','人工肘关节置换术','003315070030001','人工肘关节置换术(再置换加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315070040000','人工腕关节置换术','003315070040001','人工腕关节置换术(再置换加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315070050000','人工全髋关节置换术','003315070050001','人工全髋关节置换术(再置换加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315070070000','人工膝关节表面置换术','003315070070001','人工膝关节表面置换术(再置换加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315070080000','人工膝关节绞链式置换术','003315070080001','人工膝关节绞链式置换术(再置换加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315070090000','人工踝关节置换术','003315070090001','人工踝关节置换术(再置换加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315110030000','踝关节融合手术','003315110030001','踝关节融合手术(四关节融合术加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315120150000','_外翻矫形术','003315120150001','_外翻矫形术(截骨或有肌腱移位加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315180080000','大多角骨切除术及肌腱手术','003315180080001','大多角骨切除术及肌腱手术(关节镜下加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315200030000','手部外伤皮肤缺损游离植皮术','003315200030001','手部外伤皮肤缺损游离植皮术(多手指加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315200030000','手部外伤皮肤缺损游离植皮术','003315200030002','手部外伤皮肤缺损游离植皮术(手掌背加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315200030000','手部外伤皮肤缺损游离植皮术','003315200030003','手部外伤皮肤缺损游离植皮术(前臂者加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315200040000','手外伤局部转移皮瓣术','003315200040002','手外伤局部转移皮瓣术(前臂者加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315200040000','手外伤局部转移皮瓣术','003315200040003','手外伤局部转移皮瓣术(多手指加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315200040000','手外伤局部转移皮瓣术','003315200040001','手外伤局部转移皮瓣术(手掌背加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315210060000','手外伤推进皮瓣(V－Y)术','003315210060001','手外伤推进皮瓣(V－Y)术(双V-Y加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315210080000','手外伤清创术','003315210080001','手外伤清创术(多手指加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315210080000','手外伤清创术','003315210080003','手外伤清创术(前臂加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315210080000','手外伤清创术','003315210080002','手外伤清创术(手掌背加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316010010000','乳腺肿物穿刺术','003316010010001','乳腺肿物穿刺术(乳腺立体定位加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316010050000','乳腺癌根治术','003316010050001','乳腺癌根治术(需植皮术加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316020030000','胼胝病变切除修复术','003316020030001','胼胝病变切除修复术(植皮术加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316020040000','浅表肿物切除术','003316020040001','浅表肿物切除术(激光手术加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316020050000','海绵状血管瘤切除术(大)','003316020050001','海绵状血管瘤切除术(大)(需植皮术加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316020050000','海绵状血管瘤切除术(大)','003316020050002','海绵状血管瘤切除术(大)(激光手术加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316020060000','海绵状血管瘤切除术(中)','003316020060001','海绵状血管瘤切除术(中)(需植皮术加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316020060000','海绵状血管瘤切除术(中)','003316020060002','海绵状血管瘤切除术(中)(激光手术)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316020130000','皮肤恶性肿瘤切除术','003316020130001','皮肤恶性肿瘤切除术(植皮加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316040140000','除皱术','003316040140001','除皱术(激光除皱酌情加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003316040150000','面部瘢痕切除整形术','003316040150001','面部瘢痕切除整形术(每增加1cm2加收)',1,'普外');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003401000170000','超声波治疗','003401000170001','超声波治疗(联合治疗加收)',1,'物理治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003401000220000','泥疗','003401000220001','泥疗(全身泥疗加收)',1,'物理治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004100000030000','中药涂擦治疗','004100000030001','中药涂擦治疗(大于全身体表面积10％加收)',1,'中医治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004100000070000','中药蒸汽浴治疗','004100000070001','中药蒸汽浴治疗(超过30分钟加收)',1,'中医治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004100000080000','中药塌渍治疗','004100000080001','中药塌渍治疗(大于全身体表面积10%加收)',1,'中医治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004200000110000','关节粘连传统松懈术','004200000110001','关节粘连传统松懈术(大关节加收)',1,'中医治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004500000080000','内科妇科疾病推拿治疗','004500000080001','内科妇科疾病推拿治疗(每次20分钟，超过10分钟加收50％)',1,'中医治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004500000090000','其他推拿治疗','004500000090001','其他推拿治疗(每次20分钟，超过10分钟加收50％)',1,'中医治疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004600000010000','直肠脱出复位治疗','004600000010001','直肠脱出复位治疗(三度直肠脱垂按50%加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004600000050000','血栓性外痔切除术','004600000050001','血栓性外痔切除术(复杂性加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004600000070000','混合痔外剥内扎术','004600000070001','混合痔外剥内扎术(复杂性加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004600000080000','肛周脓肿一次性根治术','004600000080001','肛周脓肿一次性根治术(复杂性加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004600000160000','化脓性肛周大汗腺切开清创引流术','004600000160001','化脓性肛周大汗腺切开清创引流术(以肛门为中心，炎症波及半径超过3CM以上者为复杂，另加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004600000170000','肛周坏死性筋膜炎清创术','004600000170001','肛周坏死性筋膜炎清创术(病变范围超过肛周四分之一象限者为复杂，另加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('004700000070000','扁桃体烙法治疗','004700000070001','扁桃体烙法治疗(鼻中隔烙法治疗酌情加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013105170010000','种植牙冠修复置入费（单颗）','013105170010001','种植牙冠修复置入费（单颗）-即刻修复置入（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013105170010000','种植牙冠修复置入费（单颗）','013105170010002','种植牙冠修复置入费（单颗）-临时冠修复置入（减收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013105170020000','种植牙冠修复置入费（连续冠桥修复）','013105170020001','种植牙冠修复置入费（连续冠桥修复）-即刻修复置入（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013105170020000','种植牙冠修复置入费（连续冠桥修复）','013105170020002','种植牙冠修复置入费（连续冠桥修复）-临时冠修复置入（减收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013105170030000','种植牙冠修复置入费（固定咬合重建）','013105170030001','种植牙冠修复置入费（固定咬合重建）-即刻修复置入（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013105230010000','种植可摘修复置入费','013105230010001','种植可摘修复置入费-即刻修复置入（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013306090010000','种植体植入费（单颗）','013306090010001','种植体植入费（单颗）-种植体即刻种植（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013306090010000','种植体植入费（单颗）','013306090010002','种植体植入费（单颗）-颅颌面种植体植入（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013306090020000','种植体植入费（全牙弓）','013306090020001','种植体植入费（全牙弓）-种植体即刻种植（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013306090020000','种植体植入费（全牙弓）','013306090020002','种植体植入费（全牙弓）-颅颌面种植体植入（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013306090020000','种植体植入费（全牙弓）','013306090020003','种植体植入费（全牙弓）-种植体倾斜植入（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('013306090050000','口腔内植骨费（复杂）','013306090050001','口腔内植骨费（复杂）-上颌窦囊肿摘除（加收）',1,'口腔');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('332403000170000','X线立体定向放射治疗（射波刀，首次）','332403000170100','X线立体定向放射治疗（射波刀，第二次起）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('332405000060000','人体固定垫设计与制作','332405000060000','人体固定垫设计与制作加收',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('333000000000000','使用一次性卫生材料','333000000000001','使用一次性卫生材料加收',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('333106050150100','导航气管镜下活检','333106050150100','导航气管镜下活检建隧道加收',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('333314000210000','产时宫外手术','333314000210000','产时宫外手术加收',1,'妇科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003315210280000','肌腱粘连松解术','003315210280001','肌腱粘连松解术(多个手指全线松解加收)',1,'骨科');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('001102000010700','互联网首诊服务费','001102000010800','互联网首诊服务费(副主任医师)加收',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('001102000010700','互联网首诊服务费','001102000010900','互联网首诊服务费(主任医师)加收',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('001203000010000','氧气吸入','001203000010001','氧气吸入(加压给氧加收)',8,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('001204000060000','静脉输液','001204000060001','静脉输液(使用微量泵或输液泵按小时加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('001204000110000','中心静脉穿刺置管术','001204000110001','中心静脉穿刺置管术(测压加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('001204000130000','抗肿瘤化学药物配置','001204000130001','抗肿瘤化学药物配置(大剂量药物加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('001210000010000','洗胃','001210000010001','洗胃(使用洗胃机酌情加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('001401000010000','尸体料理','001401000010001','尸体料理(特殊传染病人尸体料理加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('001401000010000','尸体料理','001401000010001','尸体料理(特殊传染病人尸体料理加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('00210101001','普通透视','00210101000000','X线透视检查(加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002101020000000','X线摄影','002101020000003','X线摄影(体层摄影按层酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002101020000000','X线摄影','002101020000005','X线摄影(使用感绿片酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002101020000000','X线摄影','002101020000004','X线摄影(床旁摄片酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002101020000000','X线摄影','002101020000001','X线摄影(一张胶片多次曝光酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002101020000000','X线摄影','002101020000002','X线摄影(加滤线器计费酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002101030000000','X线造影','002101030000001','X线造影(使用数字化X线机酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002102000000000','磁共振扫描(MRI)','002102000000001','磁共振扫描(MRI)(使用心电或呼吸门控加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002102000010000','磁共振平扫','002102000010001','磁共振平扫(同时增强扫描酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002103000000000','X线计算机体层(CT)扫描','002103000010001','X线计算机体层(CT)扫描(使用螺旋扫描酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002103000000000','X线计算机体层(CT)扫描','002103000000003','X线计算机体层(CT)扫描(单次多层扫描酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002103000000000','X线计算机体层(CT)扫描','002103000010001','X线计算机体层(CT)扫描(同时增强扫描酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002103000000000','X线计算机体层(CT)扫描','002103000000004','X线计算机体层(CT)扫描(使用心电或呼吸门控设备的酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002103000000000','X线计算机体层(CT)扫描','002103000000002','X线计算机体层(CT)扫描(三维重建酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002103000010000','X线计算机体层(CT)平扫','002103000000002','X线计算机体层(CT)扫描(三维重建酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002103000010000','X线计算机体层(CT)平扫','002103000000003','X线计算机体层(CT)扫描(单次多层扫描酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002103000010000','X线计算机体层(CT)平扫','002103000000004','X线计算机体层(CT)扫描(使用心电或呼吸门控设备的酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002103000010000','X线计算机体层(CT)平扫','002103000000001','X线计算机体层(CT)扫描(使用螺旋扫描酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002105000030000','计算机断层扫描激光乳腺成像','002105000030001','计算机断层扫描激光乳腺成像(双侧加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002203010010000','彩色多普勒超声常规检查','002203010010001','彩色多普勒超声常规检查(膜腹后肿物加收)',1,'B超');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002203020030000','颈部血管彩色多普勒超声','002203020030001','颈部血管彩色多普勒超声(每增加两根加收)',1,'B超');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002203020060000','四肢血管彩色多普勒超声','002203020060001','四肢血管彩色多普勒超声(每增加两根加收)',1,'B超');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002206000040000','心脏彩色多普勒超声','002206000040001','心脏彩色多普勒超声(胎儿检查加收)',1,'B超');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002206000100000','左心功能测定','002206000100001','左心功能测定(增加指标加收)',1,'B超');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002301000010000','脏器动态扫描','002301000010001','脏器动态扫描(超过三次显像每增加一次加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002301000010000','脏器动态扫描','002301000010002','脏器动态扫描(超过一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000000000','伽玛照相','002302000000001','伽玛照相(图像融合加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000020000','脑显象','002302000020001','脑显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000060000','甲状腺静态显象','002302000060001','甲状腺静态显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000120000','静息心肌灌注显像','002302000120001','静息心肌灌注显像(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000140000','静息门控心肌灌注显象','002302000140001','静息门控心肌灌注显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000170000','平衡法门控心室显象','002302000170001','平衡法门控心室显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000180000','平衡法负荷门控心室显象','002302000180001','平衡法负荷门控心室显象(每增加一个项目加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000190000','急性心肌梗塞灶显象','002302000190001','急性心肌梗塞灶显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000240000','局部淋巴显象','002302000240001','局部淋巴显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002702000010000','体液细胞学检查与诊断','002702000010001','体液细胞学检查与诊断(需塑料包埋的标本酌情加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002703000010000','穿刺组织活检检查与诊断','002703000010001','穿刺组织活检检查与诊断(以两个蜡块为基价，超过两个酌情加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002703000020000','内镜组织活检检查与诊断','002703000020001','内镜组织活检检查与诊断(超过两个每个加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002703000030000','局部切除组织活检检查与诊断','002703000030001','局部切除组织活检检查与诊断(超过两个每个加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002703000090000','颌骨样本及牙体牙周样本诊断','002703000090002','颌骨样本及牙体牙周样本诊断(不脱钙直接切片标本加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002703000090000','颌骨样本及牙体牙周样本诊断','002703000090001','颌骨样本及牙体牙周样本诊断(超过两个加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002704000000000','冰冻切片与快速石蜡切片检查与诊断','002704000000001','冰冻切片与快速石蜡切片检查与诊断(特异性感染标本酌情加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003101000090000','体感诱发电位','003101000090001','体感诱发电位(诱发电位地形图分析加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003101000110000','事件相关电位','003101000110001','事件相关电位(增加N400检查时加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003101000160000','腰椎穿刺术','003101000160001','腰椎穿刺术(脑脊液动力学检查加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('003101000330000','周围神经毁损术','003101000330001','周围神经毁损术(三叉神经干酌情加收)',1,'一般诊疗');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000250000','肺灌注显象','002302000250001','肺灌注显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000260000','肺通气显象','002302000260001','肺通气显象(超过六个体位每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000320000','胃排空试验固体','002302000320001','胃排空试验固体(胃排空试验加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000340000','消化道出血显像','002302000340001','消化道出血显像(1小时后延迟显像加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000350000','肝胶体显象','002302000350001','肝胶体显象(增加体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000370000','肝血池显象','002302000370001','肝血池显象(每增加一个时相加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000380000','肝胆动态显象','002302000380001','肝胆动态显象(1小时后延迟显象加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000430000','肾上腺皮质显象','002302000430001','肾上腺皮质显象(延迟显象加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000430000','肾上腺皮质显象','002302000430002','肾上腺皮质显象(增加体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000440000','地塞米松抑制试验肾上腺皮质显象','002302000440001','地塞米松抑制试验肾上腺皮质显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000450000','肾动态显像','002302000450001','肾动态显像(延迟显像加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000490000','肾静态显象','002302000490001','肾静态显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000530000','局部骨显象','002302000530001','局部骨显象(增加体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000570000','炎症局部显象','002302000570001','炎症局部显象(增加一个体位)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000570000','炎症局部显象','002302000570002','炎症局部显象(延迟显象加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002302000580000','亲肿瘤症局部显象','002302000580001','亲肿瘤症局部显象(每增加一个体位加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002303000000000','亲肿瘤症局部显象(SPECT)','002303000000001','单光子发射计算机断层显象(SPECT)(采用多探头酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002303000000000','亲肿瘤症局部显象(SPECT)','002303000000002','单光子发射计算机断层显象(SPECT)(符合探测显象酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002303000000000','亲肿瘤症局部显象(SPECT)','002303000000003','单光子发射计算机断层显象(SPECT)(透射显像衰减校正酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002303000010000','脏器断层显像','002303000010001','脏器断层显像(增加时相加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002303000010000','脏器断层显像','002303000010002','脏器断层显像(增加门控加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002303000010000','脏器断层显像','002303000010002','脏器断层显像(增加门控加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002303000010000','脏器断层显像','002303000010001','脏器断层显像(增加时相加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002303000050000','负荷心肌灌注断层显象','002303000050001','负荷心肌灌注断层显象(增加门控加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002304000000000','正电子发射计算机断层显象(PET)','002304000000001','正电子发射计算机断层显象(PET)(透射显象衰减校正酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002304000000000','正电子发射计算机断层显象(PET)','002304000000002','正电子发射计算机断层显象(PET)(图象融合酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002304000070000','肿瘤全身断层显象','002304000070001','肿瘤全身断层显象(增加局部现象加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002304000100000','正电子发射计算机断层－X线计算机体层综合显像(PET/CT)','002304000100001','正电子发射计算机断层－X线计算机体层综合显像(PET/CT)(全身现象加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002304000100000','正电子发射计算机断层－X线计算机体层综合显像(PET/CT)','002304000100002','正电子发射计算机断层－X线计算机体层综合显像(PET/CT)(延迟现象加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002305000020000','甲状腺摄131碘试验','002305000020001','甲状腺摄131碘试验(增加测定次数加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002305000030000','甲状腺激素抑制试验','002305000030001','甲状腺激素抑制试验(增加测定次数加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002305000040000','过氯酸钾释放试验','002305000040001','过氯酸钾释放试验(增加测定次数加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002401000000000','放射治疗计划及剂量计算','002401000000001','放射治疗计划及剂量计算(疗程中修改计划酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002401000010000','人工制定治疗计划（简单）','002401000010000','人工制定治疗计划修改（简单）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002401000020000','人工制定治疗计划(复杂)','002401000020000','人工制定治疗计划修改(复杂)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002401000030000','计算机治疗计划系统(TPS)','002401000030000','计算机治疗计划系统(TPS)修改',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002401000040000','特定计算机治疗计划系统','002401000040000','特定计算机治疗计划系统修改',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000000000','模拟定位','002402000000002','模拟定位(疗程中定位验证酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000000000','模拟定位','002402000000001','模拟定位(疗程中修改定位酌情加收)',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000010000','简易定位','002402000010000','简易定位（修改）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000010100','X线机简易定位','002402000010100','X线机简易定位（修改）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000010200','B超简易定位','002402000010200','B超简易定位（修改）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000010300','CT简易定位','002402000010300','CT简易定位（修改）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000020000','专用X线机模拟定位','002402000020000','专用X线机模拟定位（修改）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000030000','磁共振模拟机定位','002402000030000','磁共振模拟机定位（修改）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000030000','磁共振模拟机定位','002402000030000','磁共振模拟机定位（修改）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000030000','专用X线机复杂模拟定位','002402000030000','专用X线机复杂模拟定位（修改）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002402000030100','CT模拟机定位','002402000030100','CT模拟机定位（修改）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002403000080000','体部立体定向放疗（SBRT，首次）','002403000080000','体部立体定向放疗（SBRT，第二次起）',1,'放射');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002501040120000','精子畸形率测定','002501040120001','精子畸形率测定(染色形态分析加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002503010080000','血清铁蛋白测定','002503010080001','血清铁蛋白测定(加测酸性铁蛋白等酌情加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002503020010000','葡萄糖测定','002503020010001','葡萄糖测定(床边血糖仪检测加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002503020080000','血浆乳酸测定','002503020080001','血浆乳酸测定(全血乳酸测定加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002504030040000','乙型肝炎表面抗原测定(HBsAg)','002504030040001','乙型肝炎表面抗原测定(HBsAg)(定量分析加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002504030050000','乙型肝炎表面抗体测定(AntiHBs)','002504030050001','乙型肝炎表面抗体测定(AntiHBs)(定量分析加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002504030060000','乙型肝炎e抗原测定(HBeAg)','002504030060001','乙型肝炎e抗原测定(HBeAg)(定量分析加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002504030070000','乙型肝炎e抗体测定(AntiHBe)','002504030070001','乙型肝炎e抗体测定(AntiHBe)(定量分析加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002504030080000','乙型肝炎核心抗原测定(HBcAg)','002504030080001','乙型肝炎核心抗原测定(HBcAg)(定量分析加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002600000070000','血型单特异性抗体鉴定','002600000070001','血型单特异性抗体鉴定(增加谱红细胞加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002701000010000','尸检病理诊断','002701000010001','尸检病理诊断(传染病和特异性感染病尸体酌情加收)',1,'化验');

Insert into 规则_诊疗加收 (主项编码,主项名称,从项编码,从项名称,加收限制,领域标识) 
values ('002702000000000','细胞病理学检查与诊断','002702000000001','细胞病理学检查与诊断(超过两张酌情加收)',1,'化验');

commit;
