
delete from 规则_诊疗分解;
commit;


Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('003302010','颅内肿瘤切除术','(0033020105100|00330202007|0033020201100|0033020301500)','(颅内血管重建|颅神经微血管减压|面神经松解减压|脑脊液漏修补)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00310522012','拔牙治疗','(00330604007|00330604029|0033060403800)','(创面搔刮|分根|牙龈翻瓣)','口腔科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00311201008','宫颈活检术','(0031120100801|0031120100802)','(阴道壁活检|阴道囊肿穿刺)','一般诊疗');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00320500003','经皮冠状动脉内支架置入术','(0032010000400|0032050000100)','(冠状动脉造影|经皮静脉球囊扩张)','介入治疗');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330100015','麻醉中监测','(00310701021|00310701050)','(持续中心静脉压力监测|动态血压监测)','麻醉');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330201015','颅内血肿清除术','(0033020101501|0033020101502|0033020101503)','(脑内血肿清除|硬膜外血肿清除|硬膜下血肿清除)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330201016','开颅颅内减压术','(0033020101601|0033020101602|0033020101603|0033020101604)','(大脑颞极|额极|枕极切除|颞肌下减压)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330201019','侧脑室分流术','(0033020101901|0033020101902|0033020101903)','(膀胱分流|腹腔分流|心房分流)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330201027','桥小脑角肿瘤切除术','(0033020100800|0033020400100)','(颅骨骨瓣减压|神经根粘连松解)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330201051','脑脊液漏修补术','(0033020105101|0033020105102|0033020105103)','(额窦修补|前颅窝修补|中颅窝底修补)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330203010','颈动脉外膜剥脱术','(0033020300700|0033020301001|0033020301003|0033020301004)','(颈动脉外膜剥脱|颈内动脉内膜剥脱|颈外动脉外膜剥脱|迷走神经剥离)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330203014','颈动脉结扎术','(0033020301401|0033020301402|0033020301403)','(颈内动脉结扎|颈外动脉结扎|颈总动脉结扎)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330204007','脊髓内病变切除术','(0033020400701|0033020400702)','(髓内血肿清除|髓内肿瘤)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330300011','甲状腺癌根治术','(0033030000800|0033030000900|0033030001000|00330900003|0033090000900)','(甲状腺部分切除|甲状腺次全切除|甲状腺全切|颈淋巴结清扫|胸导管结扎)','普通外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330502009','鼓室成形术','(0033050200400|0033050200800|0033050201100)','(鼓膜修补|鼓室探查|听骨链松解)','五官科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330602013','经鼻内镜鼻窦手术','(00330601008|00330601009)','(下鼻甲部分切除|中鼻甲部分切除)','五官科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330702002','肺癌根治术','(00330703012|00330703022|00330900003)','(淋巴结清扫|胸壁肿瘤切除|胸膜粘连烙断)','心胸外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00330703034','食管裂孔疝修补术','(00330703034)','(经腹各类修补|经胸各类修补|抗返流手术)','心胸外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331001011','食管癌根治术','(00331001017|00331001018)','(食管横断吻合|食管再造)','心胸外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331001017','食管横断吻合术','(0033100101701|0033100101702)','(冠状静脉结扎|经网膜静脉门静脉测压)','心胸外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331001018','胸腺切除术','(0033030001801|0033030001802)','(胸腺扩大切除|胸腺肿瘤切除)','心胸外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331101018','肾移植术','(0033110102100|0033110102200|00331102012000)','(供体肾修复|输尿管膀胱再植|移植肾探查)','泌尿外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331201001','前列腺癌根治术','(0033110302200|0033110400400)','(膀胱颈悬吊|尿道吻合)','泌尿外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331301006','卵巢癌根治术','(0033130301400|00331303015000|0033130301700)','(附件切除|盆腹腔淋巴结清除|全子宫切除术)','妇科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331501056','椎间盘切除','(00330204001|00331501037)','(脊髓和神经根粘连松解|椎管扩大成形)','骨科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331505034','踝部骨折畸形愈合矫形术','(0033150503800|0033150602100|0033151201700)','(骨移植|足部骨骨折切开复位内固定|踝关节稳定)','骨科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331507005','人工全髋关节置换术','(0033150602000|0033151200800)','(髋关节清理|髋臼造盖成形)','骨科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331507007','人工膝关节置换术','(0033150602000|0033150602001)','(滑膜切除|膝关节清理)','骨科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331514002','断指再植手术|断趾再植手术','(00330804063|00331502005|00331521029)','(肌腱吻合|神经吻合|小动脉吻合)','骨科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00331601005','乳腺癌根治','(00330900004|00331601002|00331601003|00331601004)','(单纯乳房切除|副乳切除|乳腺肿物切除|腋窝淋巴结清扫)','普通手术');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('00460000007','混合痔外剥内扎术','(0033100402400|0046000000500)','(内痔环切|血栓性外痔切除)','肛肠外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('0025010101503','全血细胞计数','(00250101002|00250101005|00250101006|00250101009|00250101010|00250101011|0025010101102|0025010101103|0025010101400)','(白细胞分类计数|白细胞计数|单核细胞直接计数|红细胞计数|淋巴细胞直接计数|嗜碱性点彩红细胞计数|嗜酸性粒细胞直接计数|网织红细胞计数|血小板计数)','化验');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('0031100000600','血液透析','(0031100000601|0031100000602|0031100000700)','(血液滤过|血液透析)','血透');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('0033010001500','麻醉中监测','(0031070102200|0031070102800|0031100000700)','(心电|血压|体温|血氧饱和度)','麻醉');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('0033020200700','颅神经微血管减压术','(0033020100900|0033020101000|0033020200800)','(颅骨修补|颅骨钻孔探查|面神经简单修复)','神经外科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('0033061200100','骨折手术','(0042000000200|0042000000300)','(骨折经皮钳夹复位|骨折橇拨复位)','骨科');

Insert into 规则_诊疗分解 (主项编码,主项名称,分项编码,分项名称,领域标识) 
values ('003315010420001','腰椎滑脱椎弓根螺钉固定植骨融合术(行椎板切除减压间盘摘除酌情加收)','(00331501038|00331501042)','(腰椎滑脱椎弓根螺钉固定植骨融合|腰椎间盘突出摘除术)','骨科');

commit;
