
delete from 规则_诊疗关联;
commit;


Insert into 规则_诊疗关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('003101000130000','术中颅神经监测','(00330201)','(神经|瘤|畸形|癫痫)','监测');

Insert into 规则_诊疗关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('003107010240000','肺动脉压和右心房压力监测','(00320400)','(介入|成形)','监测');

Insert into 规则_诊疗关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('003107010280000','血氧饱和度监测','(003107010220000)','(心电监护|心电监测)','监测');

Insert into 规则_诊疗关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('003110000120000','血透监测','(003110000060)','(血液透析)','监测');

Insert into 规则_诊疗关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('003301000150000','麻醉中监测','(00330100)','(全身麻醉|静脉麻醉|支气管内麻醉|椎管内麻醉|神经阻滞麻醉)','麻醉');

Insert into 规则_诊疗关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('003301000170000','体外膜肺氧合(ECMO)运行监测','(00330100017)','(体外循环|体外膜肺)','监测');

Insert into 规则_诊疗关联 (主项编码,主项名称,关联编码,关联名称,领域标识) 
values ('333301000380000','输血指症动态监测','(00120400006)','(输血)','监测');

commit;
