
delete from 规则_诊疗虚记;
commit;



Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00250601002','粪寄生虫卵集卵镜检',null,null,'化验');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00311503011','脑反射治疗',null,null,'精神治疗');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('003315120170000','骨移植术',null,null,'骨科');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00331506024','关节骨软骨损伤修复',null,null,'骨科');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00340200043','疼痛综合评定',null,null,'麻醉');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00250601003','粪寄生虫卵计数',null,null,'化验');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00250601001','粪寄生虫镜检',null,null,'化验');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00230200055','骨密度测定',null,null,'检查');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('004200000010000','骨折手法整复术',null,null,'骨科');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00250501026','真菌涂片检查',null,null,'化验');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00220302012','临床操作的彩色多普勒超声引导',null,null,'麻醉');

Insert into 规则_诊疗虚记 (主项编码,主项名称,排查机构,排查部门,领域标识) 
values ('00311503010','脑电生物反馈治疗',null,null,'精神治疗');

commit;

