/*********************************************************************************************
脚本说明：以下脚本用于生成门诊规则分析模型数据，运行时机构编码和机构数据表名称请注意替换成为实际机构
机构编码：H00000000000
机构名称：测试医院
结算年度: 2023
**********************************************************************************************/

--*******************************************************************************************--
--脚本：建立门诊日期校正基准表
delete from 模型_门诊日期 where 机构编码 = 'H00000000000';
commit;

insert into 模型_门诊日期 (机构编码,身份证号,就医年度,校正天数)
select distinct t.机构编码,t.身份证号,t.门诊年度,to_number(to_char(t.门诊日期,'DD')) - 1 校正天数 from 负荷_门诊就医 e, 
(select 机构编码,身份证号,to_char(门诊日期,'YYYY') 门诊年度,min(门诊日期) 门诊日期 from 负荷_门诊就医 group by 机构编码，身份证号, to_char(门诊日期,'YYYY')) t
where e.机构编码 = t.机构编码 and e.身份证号 = t.身份证号 and to_char(e.门诊日期,'YYYY') = t.门诊年度
order by t.机构编码,t.身份证号,t.门诊年度;
commit;

alter index 索引_模型_门诊日期 rebuild;

--*******************************************************************************************--
--脚本：从门诊负荷表中归集门诊诊次
delete from 模型_门诊诊次 where 机构编码 = 'H00000000000';
commit;

INSERT INTO 模型_门诊诊次 (机构等级, 机构编码, 机构名称, 姓名, 性别, 年龄, 身份证号, 险种类别, 持证类别, 
    门诊日期, 门诊天数, 门诊科室, 门诊医生, 疾病诊断, 次要诊断, 医疗人次, 医疗金额, 列支金额, 基金支付, 个账支付, 现金支付) 
select 机构等级，机构编码, 机构名称, 姓名, 性别, 年龄, 身份证号, 险种类别, 持证类别, 
    门诊日期,
    count(distinct a.身份证号 || to_char(门诊日期,'YYYYMMDD')) 门诊天数,
    listagg(a.门诊科室,'、') within group(order by a.门诊日期) 门诊科室, 
    listagg(a.门诊医生,'、') within group(order by a.门诊日期) 门诊医生,
    listagg(a.疾病诊断,'、') within group(order by a.门诊日期) 疾病诊断,
    listagg(a.次要诊断,'、') within group(order by a.门诊日期) 次要诊断,
    count(distinct a.身份证号 || to_char(支付日期,'YYYYMMDDHH24')) 医疗人次,
    sum(医疗金额) 医疗金额,
    sum(列支金额) 列支金额,
    sum(基金支付) 基金支付,
    sum(个账支付) 个账支付,
    sum(现金支付) 现金支付
from(
SELECT e.机构等级, e.机构编码, e.机构名称, e.姓名, e.性别, 
    case when 年龄 < 7 then '婴幼儿' when 年龄 < 15 then '少年儿童' when 年龄 < 65 then '劳动人口' else '老年人口' end 年龄, 
    e.身份证号, 险种类别, 持证类别, 
    e.门诊日期 - t.校正天数 门诊日期, 
    结算日期 支付日期,
    门诊科室, 门诊医生, 疾病诊断, 次要诊断,
    医疗金额,
    列支金额,
    基金支付,
    个账支付,
    现金支付
FROM 负荷_门诊就医 e inner join 模型_门诊日期 t on e.机构编码 = t.机构编码 and e.身份证号 = t.身份证号 and to_char(e.门诊日期,'YYYY') = t.就医年度
where e.机构编码 = 'H00000000000'
) a
group by 机构等级, 机构编码, 机构名称, 姓名, 性别, 年龄, 身份证号, 险种类别, 持证类别, 门诊日期
having sum(医疗金额) <> 0;
commit;

alter index 索引_模型_门诊诊次 rebuild;

--*******************************************************************************************--
--脚本：从门诊负荷表中归集门诊项目频度
delete from 模型_门诊频度 where 机构编码 = 'H00000000000';
commit;

insert into 模型_门诊频度(机构编码, 机构名称, 人员姓名, 身份证号, 门诊日期, 代码, 类别, 属性, 
    名称, 规格, 诊次, 人次, 频次, 天数, 剂量, 数量, 单位, 单价, 金额, 列支, 日期)
select 机构编码, 机构名称, 人员姓名, 身份证号, 门诊日期, 代码, 类别, 属性,名称, 规格,
    count(distinct 身份证号 || to_char(门诊日期,'YYYYMMDD')) as 诊次,
    count(distinct 身份证号 || to_char(日期,'YYYYMMDD') || 时段) as 人次,
    round(avg(次数),0) 频次,
    sum(天数) 天数,
    sum(剂量) 剂量,
    sum(数量) as 数量,
    单位,单价,
    sum(金额) 金额,
    sum(列支) 列支,
    日期
from(
select b.机构编码,b.机构名称,b.姓名 人员姓名,b.身份证号,
    b.门诊日期 - t.校正天数 门诊日期, 
    b.结算日期 支付日期,
    upper(substr(a.国标代码,1,15)) 代码,
    a.收费项目类别 类别,
    a.医疗属性类别 属性,
    a.国标名称 名称,
    a.规格,
    a.门诊号,
    a.次数,
    a.天数,
    regexp_substr(a.剂量,'[0-9]+(\.\[0-9]+)?') as 剂量,
    a.数量,
    a.数量单位 单位,
    round(a.单价,2) 单价,
    nvl(a.金额,0.0) as 金额,
    (NVL(a.金额,0.0)-NVL(a.全自费金额,0.0)-NVL(a.超限价金额,0.0)-NVL(a.先行自付金额,0.0)) as 列支,
    trunc(a.费用发生日期) - t.校正天数 as 日期,
    case when to_char(a.费用发生日期,'HH24') between '08' and '12' then '上午' 
       when to_char(a.费用发生日期,'HH24') between '13' and '17' then '下午' 
       when to_char(a.费用发生日期,'HH24') between '18' and '21' then '晚间'
       when to_char(a.费用发生日期,'HH24') between '22' and '23' then '午夜'
       when to_char(a.费用发生日期,'HH24') between '00' and '02' then '午夜'
       when to_char(a.费用发生日期,'HH24') between '03' and '07' then '凌晨'
    end 时段
from 负荷_门诊结算 a inner join 负荷_门诊就医 b on a.机构编码 = b.机构编码 and a.门诊号 = b.门诊号 and a.结算流水号 = b.结算流水号
inner join 模型_门诊日期 t on b.机构编码 = t.机构编码 and b.身份证号 = t.身份证号 and to_char(b.门诊日期,'YYYY') = t.就医年度
where b.机构编码 = 'H00000000000' and nvl(a.数量,0) <> 0
)c
group by 机构编码, 机构名称, 人员姓名, 身份证号, 门诊日期, 代码, 类别, 属性, 名称, 规格, 单位, 单价, 日期
having sum(数量) <> 0;
commit;

alter index 索引_模型_门诊频度 rebuild;

--*******************************************************************************************--
drop table 模型_门诊日期 purge;

