/*********************************************************************************************
脚本说明：以下脚本用于校正、分类住院负荷数据，运行时机构编码和机构数据表名称请注意替换成为实际机构
机构编码：H00000000000
机构名称：测试医院
**********************************************************************************************/

--*******************************************************************************************--
--脚本：对就医记录做必要的校正
--注意：

update 负荷_住院就医 set 险种类别 = '职工医保' where 机构编码 = 'H00000000000'
and regexp_instr(险种类别,'(职工|在职|退休|离休|公务员|子女|配偶|灵活|其他)') > 0
and 险种类别 <> '职工医保';
update 负荷_住院就医 set 险种类别 = '居民医保' where 机构编码 = 'H00000000000'
and regexp_instr(险种类别,'(城乡|学生|居民|儿童|未成年)') > 0
and 险种类别 <> '居民医保';
commit;

select distinct 险种类别 from 负荷_住院就医 where 机构编码 = 'H00000000000';

--无效的参保区划置为空值
update 负荷_住院就医 set 参保区划 = '' where 机构编码 = 'H00000000000' and length(参保区划) <> 6;
commit;

--select distinct 险种类别 from 负荷_住院就医 where 机构编码 = 'H00000000000';

--更改非本地参保的险种类别为异地参保
--update 负荷_住院就医 a set 险种类别 = '异地参保' where a.机构编码 = 'H00000000000'
and exists (select * from 负荷_机构摘要 b where a.机构编码 = b.机构编码 and a.参保区划 is not null and b.所属区划 is not null and a.参保区划 <> b.所属区划);
commit;

select distinct 持证类别 from 负荷_住院就医 where 机构编码 = 'H00000000000';

--校正持证人员类别,视具体内容而定
update 负荷_住院就医 set 持证类别 = '特困' where 机构编码 = 'H00000000000' and regexp_instr(持证类别,'(特困)') > 0;
update 负荷_住院就医 set 持证类别 = '低边' where 机构编码 = 'H00000000000' and regexp_instr(持证类别,'(边缘)') > 0;
update 负荷_住院就医 set 持证类别 = '低保' where 机构编码 = 'H00000000000' and regexp_instr(持证类别,'(最低生活保障|2级)') > 0;
commit;

update 负荷_住院就医 set 持证类别 = '' where 机构编码 = 'H00000000000' and 持证类别 not in ('特困','低边','低保');
commit;

--*******************************************************************************************--

--*******************************************************************************************--
--脚本：删除负荷表中住院号和结算流水号重复的住院就医记录
--注意：删除重复记录时，保留rowid较小的记录
delete from 负荷_住院就医 a where a.机构编码 = 'H00000000000' and a.rowid > 
(select min(b.rowid) from 负荷_住院就医 b where a.机构编码 = b.机构编码 and a.住院号 = b.住院号 
and a.结算流水号 = b.结算流水号);
commit;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：从身份证号校正年龄
update 负荷_住院就医 set 年龄 = (to_number(to_char(入院日期,'YYYY')) - to_number(substr(身份证号,7,4)))
where 机构编码 = 'H00000000000' and LENGTH(身份证号) = 18 and substr(身份证号,7,1) <> '*'
and nvl(年龄,-1) <> (to_number(to_char(入院日期,'YYYY')) - to_number(substr(身份证号,7,4)));
commit;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：从身份证号校正性别
update 负荷_住院就医 set 性别 = decode(mod(to_number(substr(身份证号,17,1)),2),0,'女',1,'男')
where 机构编码 = 'H00000000000' and LENGTH(身份证号) = 18 and substr(身份证号,7,1) <> '*'
and nvl(性别,'@') <> decode(mod(to_number(substr(身份证号,17,1)),2),0,'女',1,'男');
commit;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：身份证号为空的记录，使用姓名替代，保持个体的可标识性
UPDATE 负荷_住院就医 SET 身份证号 = 姓名 
where 机构编码 = 'H00000000000' and trim(身份证号) IS NULL;
commit;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：更新缺失身份证号
begin
    for cur in (select a.rowid, b.身份证号 from 负荷_住院结算 a inner join 负荷_住院就医 b 
    on a.机构编码 = b.机构编码 and a.住院号 = b.住院号 and a.机构编码 = 'H00000000000' and a.身份证号 is null) loop
    update 负荷_住院结算 set 身份证号 = cur.身份证号 where rowid = cur.rowid;
    end loop;
    commit;
end;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：校正住院天数
UPDATE 负荷_住院就医 SET 住院天数 = (nvl(出院日期,入院日期) - 入院日期 + 1) where 机构编码 = 'H00000000000' 
and 住院天数 is null and 出院日期 IS NULL and 入院日期 IS NOT NULL;
commit;

UPDATE 负荷_住院就医 SET 住院天数 = (nvl(出院日期,入院日期) - 入院日期 + 1) where 机构编码 = 'H00000000000' 
and 住院天数 <> (nvl(出院日期,入院日期) - 入院日期 + 1) and 出院日期 IS NOT NULL and 入院日期 IS NOT NULL;
commit;
--*******************************************************************************************--

select * from 负荷_住院就医 where 机构编码 = 'H00000000000'  and nvl(出院日期,入院日期) is null

--*******************************************************************************************--
--脚本：默认天数为1
UPDATE 负荷_住院结算 set 天数 = 1 where 机构编码 = 'H00000000000' and (天数 is null or 天数 = 0);
COMMIT;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：将冲红的费用明细的诊疗天数置为负值
UPDATE 负荷_住院结算 set 天数 = 0 - 天数 where 机构编码 = 'H00000000000' and 数量 < 0 and 天数 > 0;
COMMIT;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：从频次表中更新执行次数
begin
  for cur in (select a.rowid,b.执行频次 from 负荷_住院结算 a, 字典_医嘱频次 b where a.机构编码 = 'H00000000000' 
    and (LOWER(NVL(A.频次,'@')) = B.英文名称 OR NVL(A.频次,'@') = b.中文名称 OR NVL(A.频次,'@') LIKE '%' || B.中文别名 || '%')) loop
    update 负荷_住院结算 SET 次数 = cur.执行频次 where rowid = cur.rowid;
  end loop;
  commit;
end;

--*******************************************************************************************--
--脚本：从默认表中更新执行次数
begin
  for cur in (select a.rowid,a.数量/abs(a.天数) 执行次数 from 负荷_住院结算 a where a.机构编码 = 'H00000000000'
    and exists (select 1 from 字典_诊疗次数 b where upper(a.国标代码) like nvl(b.项目编码,'@') || '%' or upper(a.国标代码) like nvl(b.国家项目编码,'@') || '%'))loop
    update 负荷_住院结算 set 次数 = cur.执行次数 where rowid = cur.rowid;
  end loop;
  commit;
end;

--脚本：默认次数为1
update 负荷_住院结算 set 次数 = 1 where 机构编码 = 'H00000000000' and 次数 is null;
commit;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：保持项目名称不为空
UPDATE 负荷_住院结算 set 项目名称 = 商品名 where 机构编码 = 'H00000000000' and 项目名称 IS NULL and 商品名 IS NOT NULL;
COMMIT;

UPDATE 负荷_住院结算 set 项目名称 = 国标名称 where 机构编码 = 'H00000000000' and 项目名称 IS NULL and 国标名称 IS NOT NULL;
COMMIT;

UPDATE 负荷_住院结算 set 国标名称 = 项目名称 where 机构编码 = 'H00000000000' and 国标名称 IS NULL and 项目名称 IS NOT NULL;
COMMIT;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：从费用分类表中按省标通配更新收费项目类别和医疗属性类别
begin
  for cur in (
    select distinct a.rowid, b.费用项目, b.类目名称 from 负荷_住院结算 a, 字典_诊疗分类 b 
    where a.机构编码 = 'H00000000000' and nvl(a.收费项目类别,'@') not like '%药%' and nvl(a.收费项目类别,'@') not like '%材料%'
    and upper(a.国标代码) like upper (b.省标通配) || '%' and b.目录级别 = '0' 
    ) loop
    update 负荷_住院结算 set 收费项目类别 = cur.费用项目, 医疗属性类别 = cur.类目名称 where rowid = cur.rowid;
  end loop;
  commit;
end;
--脚本：从费用分类表中按国标通配更新收费项目类别和医疗属性类别
begin
  for cur in (
    select distinct a.rowid, b.费用项目, b.类目名称 from 负荷_住院结算 a, 字典_诊疗分类 b 
    where a.机构编码 = 'H00000000000' and nvl(a.收费项目类别,'@') not like '%药%' and nvl(a.收费项目类别,'@') not like '%材料%'
    and upper(a.国标代码) like upper(b.国标通配) || '%' and b.目录级别 = '0' 
    ) loop
    update 负荷_住院结算 set 收费项目类别 = cur.费用项目, 医疗属性类别 = cur.类目名称 where rowid = cur.rowid;
  end loop;
  commit;
end;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：从药品分类表中按国标通配更新收费项目类别和医疗属性类别
begin
  for cur in (
    select distinct a.rowid, b.费用项目, b.类目名称 from 负荷_住院结算 a, 字典_药品分类 b 
    where a.机构编码 = 'H00000000000' and nvl(a.收费项目类别,'@') like '%药%'
    and upper(a.国标代码) like upper(b.类目编码) || '%' and b.目录级别 = '0' 
    ) loop
    update 负荷_住院结算 set 收费项目类别 = cur.费用项目, 医疗属性类别 = cur.类目名称 where rowid = cur.rowid;
  end loop;
  commit;
end;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：更新编码内药品和材料分类
update 负荷_住院结算 set 收费项目类别 = '草药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '草药费' and UPPER(国标代码) like 'C%' AND LENGTH(国标代码) > 12 AND LENGTH(国标代码) < 20;
update 负荷_住院结算 set 收费项目类别 = '材料费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '材料费' and UPPER(国标代码) like 'C%' AND LENGTH(国标代码) = 12;
update 负荷_住院结算 set 收费项目类别 = '材料费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '材料费' and UPPER(国标代码) like 'C%' AND LENGTH(国标代码) > 20;
update 负荷_住院结算 set 收费项目类别 = '西药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '西药费' and UPPER(国标代码) like 'X%';
update 负荷_住院结算 set 收费项目类别 = '成药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '成药费' and UPPER(国标代码) like 'Z%';
update 负荷_住院结算 set 收费项目类别 = '草药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '草药费' and UPPER(国标代码) like 'T%';
COMMIT;
--脚本：更新编码外药品和材料分类
UPDATE 负荷_住院结算 SET 收费项目类别 = '西药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '西药费' AND UPPER(国标代码) like 'LA%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '成药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '成药费' AND UPPER(国标代码) like 'LB%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '西药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '西药费' AND UPPER(国标代码) like 'SYX%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '材料费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '材料费' AND UPPER(国标代码) like 'Q%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '西药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '西药费' AND UPPER(国标代码) like '8000000000000001%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '成药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '成药费' AND UPPER(国标代码) like '8000000000000002%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '其他费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '其他费' AND UPPER(国标代码) like '8000000000000003%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '材料费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '材料费' AND UPPER(国标代码) like '8000000000000004%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '草药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '草药费' AND UPPER(国标代码) like '5000000000000002%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '西药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '西药费' AND UPPER(国标代码) like '7000000000000001%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '草药费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '草药费' AND UPPER(国标代码) like '9000000000000001%' and 数量单位 like '%g%';
UPDATE 负荷_住院结算 SET 收费项目类别 = '其他服务费' where 机构编码 = 'H00000000000' and nvl(收费项目类别,'@') <> '其他服务费' AND UPPER(国标代码) like '9000000000000001%';
COMMIT;
--*******************************************************************************************--

/***********************************************************************************************
说明：需再检查收费项目类别是否规整，以下费用项目之外的类型必须被重新归类
药品材料项目：[西药费、成药费、草药费、材料费]
检查化验项目：[化验费、病理费、检查费]
人头费用项目：[挂号费、诊查费、床位费、会诊费、巡诊费]
护理相关项目：[护理费、注射费]
一般诊疗项目：[一般诊疗费、吸氧费、注射费]
手术麻醉项目：[手术费、麻醉费]
急救治疗项目：[急救费、抢救费]
特殊治疗项目：[介入治疗费、放射治疗费、精神治疗费]
精神专科项目：[精神治疗费]
康复理疗项目：[康复治疗费、物理治疗费]
中医治疗项目：[中医论治费、中医治疗费]
其他费用项目：[体检费、疫苗费、其他服务费]
***********************************************************************************************/

--脚本：应再查看收费项目类别是否还存在以上列出的项目
select distinct 收费项目类别 from 负荷_住院结算 where 机构编码 = 'H00000000000';

--脚本：按项目类别重新归类
--说明：仅用于示例，按实际情况修改
/*
update 负荷_住院结算 set 收费项目类别 = '诊查费' where 机构编码 = 'H00000000000' and 收费项目类别 = '诊察费';
update 负荷_住院结算 set 收费项目类别 = '成药费' where 机构编码 = 'H00000000000' and 收费项目类别 = '中成药';
update 负荷_住院结算 set 收费项目类别 = '草药费' where 机构编码 = 'H00000000000' and 收费项目类别 = '中草药';
update 负荷_住院结算 set 收费项目类别 = '检查费' where 机构编码 = 'H00000000000' and 收费项目类别 = '放射费';
update 负荷_住院结算 set 收费项目类别 = '检查费' where 机构编码 = 'H00000000000' and 收费项目类别 = '心电费';
update 负荷_住院结算 set 收费项目类别 = '检查费' where 机构编码 = 'H00000000000' and 收费项目类别 = 'B超费';
update 负荷_住院结算 set 收费项目类别 = '化验费' where 机构编码 = 'H00000000000' and 收费项目类别 = '检验费';
update 负荷_住院结算 set 收费项目类别 = '其他服务费' where 机构编码 = 'H00000000000' and 收费项目类别 = '煎药费';
commit;
*/

--脚本：应再查看属于其他费的项目是否存在归类错误的问题
select distinct 项目名称 from 负荷_住院结算 where 机构编码 = 'H00000000000' and 收费项目类别 = '中成药'
select distinct 项目名称 from 负荷_住院结算 where 机构编码 = 'H00000000000' and 收费项目类别 = '中草药'
select distinct 项目名称 from 负荷_住院结算 where 机构编码 = 'H00000000000' and 收费项目类别 = '治疗费'
select distinct 项目名称 from 负荷_住院结算 where 机构编码 = 'H00000000000' and 收费项目类别 = '其他费'
select distinct 项目名称 from 负荷_住院结算 where 机构编码 = 'H00000000000' and 收费项目类别 = '其他服务费'

--脚本：按项目名称重新归类
--说明：仅用于示例，按实际情况修改

update 负荷_住院结算 set 收费项目类别 = '西药费' where 机构编码 = 'H00000000000' and 项目名称 in ('人血白蛋白') 
and 收费项目类别 <> '西药费';
update 负荷_住院结算 set 收费项目类别 = '成药费' where 机构编码 = 'H00000000000' and 项目名称 in ('小儿热速清颗粒') 
and 收费项目类别 <> '成药费';
update 负荷_住院结算 set 收费项目类别 = '诊查费' where 机构编码 = 'H00000000000' and 项目名称 in ('等级护理(一级医院)','中医辨证论治(副主任医师)'，'中医辨证论治')
and 收费项目类别 <> '诊查费';
update 负荷_住院结算 set 收费项目类别 = '护理费' where 机构编码 = 'H00000000000' and 项目名称 in ('等级护理(一级医院)')
and 收费项目类别 <> '护理费';
update 负荷_住院结算 set 收费项目类别 = '一般诊疗费' where 机构编码 = 'H00000000000' and 项目名称 in ('视网膜激光光凝术（单眼）*丙类','静脉置管冲洗','冠修复（全冠）','根管再治疗术'，'前磨牙拔除术(该区段多生牙)'，
'即刻义齿(拔牙前制作即刻义齿)'，'龈下刮治(龈下超声刮治)'，'粘结','中清创(不缝合)','桩冠修复(简单桩冠)','牙齿漂白术','手法牵引复位术','根管充填术(使用特殊仪器加收)',
'合创伤正畸治疗(由咬合因素引起的合创伤)','子宫输卵管通液术(通气)','种植体周围炎治疗','阻生牙拔除术(低位阻生的牙)','固定矫治器复诊处置','冠修复','复杂牙拔除术(死髓或牙体治疗后其脆性增加)',
'牙体桩钉固位修复术(大面积缺损的充填)','13碳尿素呼气试验','牙周固定(联合固定)','膀胱冲洗','急性坏死性龈炎局部清创(上药)','胼胝病变切除修复术','牙槽骨修整术','根管充填术',
'义齿组织面重衬(硬衬)'，'塑料可摘局部义齿(无卡环塑料可摘局部义齿)'，'乳牙期安氏I类错正畸治疗'，'龈下刮治(手工刮治)'，'磨牙拔除术(该区段多生牙)','阻生牙拔除术(多生牙)','洁治(手工洁治)','复杂充填术',
'踝关节融合手术','宫腔内异物取出术','膀胱持续冲洗','辅助操作','手工分冰冻血浆，每100毫升','中心静脉穿刺置管术','胃肠减压','静脉输液(注药)',
'纤维支气管镜检查','俯卧位通气治疗(新冠中型及以上)') 
and 收费项目类别 <> '一般诊疗费';
update 负荷_住院结算 set 收费项目类别 = '手术费' where 机构编码 = 'H00000000000' and 项目名称 in ('人工肱骨头置换术','睾丸切除术','腋臭切除术','足部骨骨折切开复位内固定术') 
and 收费项目类别 <> '手术费';
update 负荷_住院结算 set 收费项目类别 = '吸氧费' where 机构编码 = 'H00000000000' and 项目名称 in ('吸氧') 
and 收费项目类别 <> '吸氧费';
update 负荷_住院结算 set 收费项目类别 = '麻醉费' where 机构编码 = 'H00000000000' and 项目名称 in ('局部浸润麻醉','麻醉中监测','硬膜外阻滞麻醉','腰麻醉') 
and 收费项目类别 <> '麻醉费';
update 负荷_住院结算 set 收费项目类别 = '注射费' where 机构编码 = 'H00000000000' and 项目名称 in ('皮试'，'肌肉注射','皮下注射','静脉采血(公卫减免)','静脉输液（门诊/不含输液器）','静脉采血') 
and 收费项目类别 <> '注射费';
update 负荷_住院结算 set 收费项目类别 = '精神治疗费' where 机构编码 = 'H00000000000' and 项目名称 in ('暗示治疗（外院）','儿童发育量表(PEP)') 
and 收费项目类别 <> '精神治疗费';
update 负荷_住院结算 set 收费项目类别 = '物理治疗费' where 机构编码 = 'H00000000000' and 项目名称 in ('红外线治疗(TDP)','红外线治疗','红外线治疗（红外线真空拔罐治疗红外线光浴治疗）') 
and 收费项目类别 <> '物理治疗费';
update 负荷_住院结算 set 收费项目类别 = '中医治疗费' where 机构编码 = 'H00000000000' and 项目名称 in ('普通针刺（体针)（小于等于20穴）','电针(普通电针)（大于20穴位/次）','拔罐疗法(火罐)（3罐/次）',
'小针刀治疗（刃针治疗）'，'贴敷疗法(中)') 
and 收费项目类别 <> '中医治疗费';
update 负荷_住院结算 set 收费项目类别 = '疫苗费' where 机构编码 = 'H00000000000' and 项目名称 like '%疫苗%' and 收费项目类别 <> '疫苗费';
update 负荷_住院结算 set 收费项目类别 = '材料费' where 机构编码 = 'H00000000000' and 项目名称 in ('锚钉','捆绑材料','修复材料','固定板') 
and 收费项目类别 <> '材料费';
update 负荷_住院结算 set 收费项目类别 = '材料费' where 机构编码 = 'H00000000000' and regexp_instr(项目名称,'(输液器|注射器|敷贴|明胶海绵)') > 0 and 收费项目类别 = '其他费';
update 负荷_住院结算 set 收费项目类别 = '材料费' where 机构编码 = 'H00000000000' and 项目名称 in ('棉签','一次性鼻导管[进口]','清创包','头罩') 
and 收费项目类别 <> '材料费';
update 负荷_住院结算 set 收费项目类别 = '检查费' where 机构编码 = 'H00000000000' and 项目名称 in ('黑白打印照片','彩色打印照片','常规心电图检查（外院）','心电向量图（外院）','计算机图文报告','浅表器官彩超检查(一个部位)','数字化摄影(DR)','骨密度测定（单能）') 
and 收费项目类别 <> '检查费';
update 负荷_住院结算 set 收费项目类别 = '化验费' where 机构编码 = 'H00000000000' and 项目名称 in ('结核感染T细胞检测','百日咳杆菌培养','细菌抗体测定','降钙素原测定',
'百日咳抗体PT.FHA（IgG）定量检测试剂盒（酶联免疫法）','骨钙素N端中分子片段测定（N-MID）','镁测定(干化学法)','各种白介素测定','梅毒螺旋体特异抗体测定(印迹法)',
'各类病原体DNA测定','新型冠状病毒抗体检测','人免疫缺陷病毒抗体测定(Anti-HIV)(各种免疫学方法)','？-葡萄糖醛酸苷酶测定','β－胶原降解产物测定（β－CTX）',
'快速血浆反应素试验（RPR）')
and 收费项目类别 <> '化验费';
update 负荷_住院结算 set 收费项目类别 = '其他服务费' where 机构编码 = 'H00000000000' and 项目名称 in ('煎药费') 
and 收费项目类别 <> '其他服务费';
update 负荷_住院结算 set 收费项目类别 = '体检费' where 机构编码 = 'H00000000000' and 项目名称 like '%体检%' and 收费项目类别 = '其他费';
commit;

--*******************************************************************************************--

