/*********************************************************************************************
脚本说明：以下脚本用于生成库房进销数据，运行时机构编码和机构数据表名称请注意替换成为实际机构
机构编码：H00000000000
机构名称：测试医院
**********************************************************************************************/

--*******************************************************************************************--
--脚本：从门诊、住院结算负荷表中归集药品、材料计费数据
drop table 临时_物资销售 purge;

create table 临时_物资销售 as 
select 机构编码,机构名称,业务周期,代码,类别,属性,名称,规格,
       SUM(数量) 销售数量,SUM(金额) 销售金额,
       trunc(sum(数量*单价) / sum(数量),2) 销售均价,单位 销售单位
from(
SELECT 机构编码,机构名称,to_char(费用发生日期,'YYYYMM') as 业务周期,国标代码 代码,
DECODE(收费项目类别,'西药费','西药','成药费','成药','草药费','饮片','材料') 类别,医疗属性类别 属性,
商品名 名称,规格,数量,金额,单价,数量单位 单位 FROM 负荷_住院结算
WHERE 机构编码 = 'H00000000000' and 收费项目类别 IN ('西药费','成药费','草药费','材料费')
and substr(upper(国标代码),1,1) in ('C','X','Z')
union all
SELECT 机构编码,机构名称,to_char(费用发生日期,'YYYYMM') as 业务周期,国标代码 代码,
DECODE(收费项目类别,'西药费','西药','成药费','成药','草药费','饮片','材料') 类别,医疗属性类别 属性,
商品名 名称,规格,数量,金额,单价,数量单位 单位 FROM 负荷_门诊结算
WHERE 机构编码 = 'H00000000000' and 收费项目类别 IN ('西药费','成药费','草药费','材料费')
and substr(upper(国标代码),1,1) in ('C','X','Z')
) a
GROUP BY 机构编码,机构名称,业务周期,代码,类别,属性,名称,规格,单价,单位
having sum(数量) > 0;

--脚本：从药库、药房消耗负荷表中归集药品、材料购入数据
drop table 临时_物资购入 purge;

create table 临时_物资购入 as 
select 机构编码,机构名称,代码,拆零比,
       sum(数量) as 购入数量,sum(数量*单价) as 购入金额,trunc(sum(数量*单价) / sum(数量),2) as 购入均价, 
       单位 购入单位, 业务期间
from(
select 机构编码,机构名称,国标代码 as 代码,拆零比,
       数量,数量*购入价 as 金额,购入价 单价, 包装单位 as 单位, to_char(业务日期,'YYYYMM') as 业务期间
from 负荷_药库消耗 where 机构编码 = 'H00000000000' and 业务类型 in ('物资采购')
and substr(upper(国标代码),1,1) in ('C','X','Z')
union all
select 机构编码,机构名称,国标代码 as 代码,拆零比,
       数量,数量*购入价 as 金额,购入价 单价, 包装单位 as 单位, to_char(业务日期,'YYYYMM') as 业务期间
from 负荷_药房消耗 where 机构编码 = 'H00000000000' and 业务类型 in ('物资采购')
and substr(upper(国标代码),1,1) in ('C','X','Z')
) a
group by 机构编码,机构名称,代码,拆零比,单位,业务期间
having sum(数量) <> 0;


--脚本：从药库、药房结转负荷表中归集药品、材料库存数据
drop table 临时_物资库存 purge;

create table 临时_物资库存 as 
select 机构编码,机构名称,代码,拆零比,
       sum(数量) as 库存数量,sum(数量*单价) as 库存金额,trunc(sum(数量*单价) / sum(数量),2) as 库存均价, 
      单位 库存单位, 业务期间
from(
select 机构编码,机构名称,国标代码 as 代码,拆零比,
       本期结存数 数量,本期结存数*购入价 as 金额,购入价 单价, 库存单位 单位, to_char(结转日期,'YYYYMM') as 业务期间
from 负荷_药库结转 where 机构编码 = 'H00000000000'
and substr(upper(国标代码),1,1) in ('C','X','Z')
union all
select 机构编码,机构名称,国标代码 as 代码,拆零比,
       本期结存数 数量,本期结存数*购入价 as 金额,购入价 单价, 库存单位 单位, to_char(结转日期,'YYYYMM') as 业务期间
from 负荷_药房结转 where 机构编码 = 'H00000000000'
and substr(upper(国标代码),1,1) in ('C','X','Z')
) a
group by 机构编码,机构名称,代码,拆零比,单位,业务期间
having sum(数量) <> 0;
--*******************************************************************************************--

--*******************************************************************************************--
--脚本：将临时物资购入、销售数据归集至库房进销表
delete from 模型_库房进销 where 机构编码 = 'H00000000000';
commit;

INSERT INTO 模型_库房进销 (机构编码, 机构名称, 业务期间, 代码, 类别, 属性, 名称, 规格, 销售数量, 销售金额, 销售均价, 销售单位)
select 机构编码, 机构名称, 业务周期, 代码, 类别, 属性, 名称, 规格, 销售数量, 销售金额, 销售均价, 销售单位
from 临时_物资销售
ORDER BY 业务周期, 代码;
commit;

alter index 索引_模型_库房进销 rebuild;

--脚本：更新库房购入
begin
  for cur in (
    select a.rowid, b.购入数量,b.购入金额,b.购入均价,b.购入单位,b.拆零比
    from 模型_库房进销 a,临时_物资购入 b 
    where a.机构编码 = 'H00000000000' and a.机构编码 = b.机构编码 and a.业务期间 = b.业务期间 and a.代码 = b.代码
    ) loop
    update 模型_库房进销 
    set 购入数量 = cur.购入数量,
    购入金额 = cur.购入金额,
    购入均价 = cur.购入均价,
    购入单位 = cur.购入单位,
    拆零比 = cur.拆零比 where rowid = cur.rowid;
    end loop;
  commit;
end;

--脚本：更新库房库存
begin
  for cur in (
    select a.rowid, b.库存数量,b.库存金额,b.库存均价,b.库存单位 from 模型_库房进销 a,临时_物资库存 b 
    where a.机构编码 = 'H00000000000' and a.机构编码 = b.机构编码 and a.业务期间 = b.业务期间 and a.代码 = b.代码
    ) loop
    update 模型_库房进销 
    set 库存数量 = cur.库存数量,
    库存金额 = cur.库存金额,
    库存均价 = cur.库存均价,
    库存单位 = cur.库存单位 where rowid = cur.rowid;
    end loop;
  commit;
end;
--*******************************************************************************************--

select * from 模型_库房进销 where 购入数量 is not null and 销售数量 is not null and 库存数量 is not NULL

--脚本：删除临时表
drop table 临时_物资销售 purge;
drop table 临时_物资购入 purge;
drop table 临时_物资库存 purge;


