/*********************************************************************************************
脚本说明：以下脚本用于生成库房进销数据，运行时机构编码和机构数据表名称请注意替换成为实际机构
机构编码：H00000000000
机构名称：测试医院
**********************************************************************************************/


--*******************************************************************************************--
--脚本：库房销售数据归集至库房频度表
delete from 模型_库房频度 where 机构编码 = 'H00000000000';
commit;

insert into 模型_库房频度(机构编码, 机构名称, 就医来源, 部门科室, 人员姓名, 身份证号, 业务期间, 代码, 类别, 属性, 
    名称, 规格, 数量, 单位, 单价, 金额, 列支, 日期)
select 机构编码, 机构名称, 就医来源, 部门科室, 人员姓名, 身份证号, 
    case
        when substr(业务期间,5,2) in ('01','02','03') then substr(业务期间,1,4) || '-1'
        when substr(业务期间,5,2) in ('04','05','06') then substr(业务期间,1,4) || '-2'
        when substr(业务期间,5,2) in ('07','08','09') then substr(业务期间,1,4) || '-3'
        when substr(业务期间,5,2) in ('10','11','12') then substr(业务期间,1,4) || '-4'
    end 业务期间, 代码, 类别, 属性,名称, 规格,
    sum(数量) as 数量,
    单位,单价,
    sum(金额) 金额,
    sum(列支) 列支,
    日期
from(
select a.机构编码,a.机构名称,
    '门诊' 就医来源, a.费用科室名称 部门科室,
    a.人员姓名, a.身份证号,
    to_char(a.费用发生日期,'YYYYMM') 业务期间,
    upper(substr(a.国标代码,1,15)) 代码,
    a.收费项目类别 类别,
    a.医疗属性类别 属性,
    a.国标名称 名称,
    a.规格,
    a.数量,
    a.数量单位 单位,
    round(a.单价,2) 单价,
    nvl(a.金额,0.0) as 金额,
    (NVL(a.金额,0.0)-NVL(a.全自费金额,0.0)-NVL(a.超限价金额,0.0)-NVL(a.先行自付金额,0.0)) as 列支,
    trunc(a.费用发生日期) 日期
from 负荷_门诊结算 a 
where a.机构编码 = 'H00000000000' and nvl(a.数量,0) <> 0
)c
group by 机构编码, 机构名称, 就医来源, 部门科室, 人员姓名, 身份证号, 业务期间, 代码, 类别, 属性, 名称, 规格, 单位, 单价, 日期
having sum(数量) <> 0;
commit;

insert into 模型_库房频度(机构编码, 机构名称, 就医来源, 部门科室, 人员姓名, 身份证号, 业务期间, 代码, 类别, 属性, 
    名称, 规格, 数量, 单位, 单价, 金额, 列支, 日期)
select 机构编码, 机构名称, 就医来源, 部门科室, 人员姓名, 身份证号, 
    case
        when substr(业务期间,5,2) in ('01','02','03') then substr(业务期间,1,4) || '-1'
        when substr(业务期间,5,2) in ('04','05','06') then substr(业务期间,1,4) || '-2'
        when substr(业务期间,5,2) in ('07','08','09') then substr(业务期间,1,4) || '-3'
        when substr(业务期间,5,2) in ('10','11','12') then substr(业务期间,1,4) || '-4'
    end 业务期间, 代码, 类别, 属性,名称, 规格,
    sum(数量) as 数量,
    单位,单价,
    sum(金额) 金额,
    sum(列支) 列支,
    日期
from(
select a.机构编码,a.机构名称,
    '住院' 就医来源, a.费用科室名称 部门科室,
    a.人员姓名, a.身份证号,
    to_char(a.费用发生日期,'YYYYMM') 业务期间,
    upper(substr(a.国标代码,1,15)) 代码,
    a.收费项目类别 类别,
    a.医疗属性类别 属性,
    a.国标名称 名称,
    a.规格,
    a.数量,
    a.数量单位 单位,
    round(a.单价,2) 单价,
    nvl(a.金额,0.0) as 金额,
    (NVL(a.金额,0.0)-NVL(a.全自费金额,0.0)-NVL(a.超限价金额,0.0)-NVL(a.先行自付金额,0.0)) as 列支,
    trunc(a.费用发生日期) 日期
from 负荷_住院结算 a 
where a.机构编码 = 'H00000000000' and nvl(a.数量,0) <> 0
)c
group by 机构编码, 机构名称, 就医来源, 部门科室, 人员姓名, 身份证号, 业务期间, 代码, 类别, 属性, 名称, 规格, 单位, 单价, 日期
having sum(数量) <> 0;
commit;

alter index 索引_模型_库房频度 rebuild;
--*******************************************************************************************--


